{
  "lastUpdated": "2026-02-26T20:42:18.139858+00:00",
  "articles": [
    {
      "title": "City Council rejects effort to ask Wu administration for info on ICE detainer requests",
      "link": "https://www.boston.com/news/local-news/2026/02/26/city-council-rejects-effort-to-ask-wu-administration-for-info-on-ice-detainer-requests/",
      "pubDate": "Thu, 26 Feb 2026 20:29:02 +0000",
      "description": "<p>In accordance with a city law, the Boston Police Department ignored every detainer request ICE sent to the city last year. </p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/26/city-council-rejects-effort-to-ask-wu-administration-for-info-on-ice-detainer-requests/\">City Council rejects effort to ask Wu administration for info on ICE detainer requests</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "0684c2afd1fa90399727231549aadcb1",
      "summary": [
        "City Council voted against requesting ICE detainer information from the Wu administration.",
        "Boston Police Department ignored all ICE detainer requests in 2022, per city law.",
        "This decision affects local immigrant communities and their interactions with law enforcement."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Here’s why Boston streets seem clearer than after the last big storm",
      "link": "https://www.boston.com/news/local-news/2026/02/26/boston-snow-removal-blizzard/",
      "pubDate": "Thu, 26 Feb 2026 20:19:35 +0000",
      "description": "<p>“I think we have made a huge amount of headway with this most recent blizzard in getting everything back up and running in Boston,” Mayor Michelle Wu said.</p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/26/boston-snow-removal-blizzard/\">Here’s why Boston streets seem clearer than after the last big storm</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "c1bce7cce0d56c2733f986a105469ac3",
      "summary": [
        "Mayor Michelle Wu reports significant progress in snow removal after the recent blizzard.",
        "Boston streets are clearer compared to previous storms, enhancing mobility for residents.",
        "Efficient snow management aims to improve public safety and access to city services."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "This Mass. bride and groom skied Killington fresh off their vows and in wedding attire",
      "link": "https://www.boston.com/travel/new-england-travel/2026/02/26/mass-bride-and-groom-skied-killington-in-wedding-attire/",
      "pubDate": "Thu, 26 Feb 2026 19:53:51 +0000",
      "description": "<p>\"During our first dance, I was leaving a snail trail behind me of melting snow.\"</p>\n<p>The post <a href=\"https://www.boston.com/travel/new-england-travel/2026/02/26/mass-bride-and-groom-skied-killington-in-wedding-attire/\">This Mass. bride and groom skied Killington fresh off their vows and in wedding attire</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "a050f4161f02bf665724c030087b8825",
      "summary": [
        "Massachusetts couple skied at Killington immediately after their wedding ceremony.",
        "The bride and groom wore wedding attire while skiing on February 26, 2026.",
        "Their unique celebration highlights local winter sports culture and wedding trends."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Report: Anfernee Simons played with wrist fracture during time with Celtics",
      "link": "https://www.boston.com/sports/boston-celtics/2026/02/26/anfernee-simons-celtics-bulls-wrist-injury-comments/",
      "pubDate": "Thu, 26 Feb 2026 19:32:57 +0000",
      "description": "<p>\"The last time it happened to him, it was in training camp in Boston. It was like a week or 10 days.\"</p>\n<p>The post <a href=\"https://www.boston.com/sports/boston-celtics/2026/02/26/anfernee-simons-celtics-bulls-wrist-injury-comments/\">Report: Anfernee Simons played with wrist fracture during time with Celtics</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "87307485d5a633b1cf3dfc41a586338f",
      "summary": [
        "Anfernee Simons played with a wrist fracture during his time with the Celtics.",
        "This injury occurred during training camp in Boston, lasting about 10 days.",
        "Simons' condition raises concerns about player health and management for local fans."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Boston Fleet focused on games ahead, not recent slight of US women’s hockey team by Trump",
      "link": "https://www.boston.com/sports/sports-news/2026/02/26/womens-hockey-donald-trump-joke/",
      "pubDate": "Thu, 26 Feb 2026 19:17:44 +0000",
      "description": "<p>\"It’s such a special moment and an incredible accomplishment, and anything that detracts from that, for me, is unnecessary.\"</p>\n<p>The post <a href=\"https://www.boston.com/sports/sports-news/2026/02/26/womens-hockey-donald-trump-joke/\">Boston Fleet focused on games ahead, not recent slight of US women’s hockey team by Trump</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "bbef6152eda973b0e33d9216c1d9869f",
      "summary": [
        "Boston Fleet prioritizes upcoming games over Trump's comments on women's hockey team.",
        "Team emphasizes focus on performance despite distractions from external criticism.",
        "Local support for women's sports remains strong among Boston residents."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "MBTA Commuter Rail experiences more delays due to snow cleanup and vehicle on track",
      "link": "https://www.boston.com/travel/transportation/2026/02/26/mbta-commuter-rail-experiences-more-delays-due-to-snow-cleanup-and-vehicle-on-track/",
      "pubDate": "Thu, 26 Feb 2026 19:10:27 +0000",
      "description": "<p>\"Cleanup efforts are continuing, with nearly three feet of snow along some parts of the network,\" a spokesperson said.</p>\n<p>The post <a href=\"https://www.boston.com/travel/transportation/2026/02/26/mbta-commuter-rail-experiences-more-delays-due-to-snow-cleanup-and-vehicle-on-track/\">MBTA Commuter Rail experiences more delays due to snow cleanup and vehicle on track</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "571baa6f4eab25e36616e79d04cd3e36",
      "summary": [
        "MBTA Commuter Rail faces delays due to ongoing snow cleanup efforts.",
        "Nearly three feet of snow affects parts of the network, complicating services.",
        "Boston residents should expect continued disruptions in their daily commutes."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 6,
    "feedSize": 10,
    "timestamp": "2026-02-26T20:42:18.139879+00:00"
  }
}