{
  "lastUpdated": "2025-09-05T18:45:04.549824+00:00",
  "articles": [
    {
      "title": "Here’s what fantasy football experts are saying about Patriots players in Week 1",
      "link": "https://www.boston.com/sports/new-england-patriots/2025/09/05/patriots-fantasy-football-players-week-1/",
      "pubDate": "Fri, 05 Sep 2025 18:34:34 +0000",
      "description": "<p>A matchup against the Raiders could create some intriguing possibilities. </p>\n<p>The post <a href=\"https://www.boston.com/sports/new-england-patriots/2025/09/05/patriots-fantasy-football-players-week-1/\">Here&#8217;s what fantasy football experts are saying about Patriots players in Week 1</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "38637aa0ca3aa9f5a8af24007a0fd8a7",
      "summary": [
        "Patriots face Raiders on September 10, offering fantasy football opportunities for local players.",
        "Experts suggest key players like Mac Jones and Rhamondre Stevenson could excel this week.",
        "Local fans may benefit from increased engagement in fantasy leagues with Patriots' performance."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Hundred-year book debate: Which 1926 classic still stands the test of time?",
      "link": "https://www.boston.com/community/tell-us/2025/09/05/hundred-year-book-debate/",
      "pubDate": "Fri, 05 Sep 2025 18:28:43 +0000",
      "description": "<p>From Hemingway to Hughes, vote for the best book of 1926 — and share your pick for a modern book that might resonate in 2126.</p>\n<p>The post <a href=\"https://www.boston.com/community/tell-us/2025/09/05/hundred-year-book-debate/\">Hundred-year book debate: Which 1926 classic still stands the test of time?</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "9dc53607655c615695db856d09332bae",
      "summary": [
        "Vote for the best book of 1926 to engage Boston's literary community.",
        "Participate in discussions about modern books that may resonate in 2126.",
        "Encourage local residents to reflect on literature's lasting impact on culture."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "As Fernandes Anderson’s sentencing looms, read what Boston city councilors wrote in letters to judge",
      "link": "https://www.boston.com/news/politics/2025/09/05/boston-city-councilors-write-support-tania-fernandes-anderson-sentencing/",
      "pubDate": "Fri, 05 Sep 2025 18:11:23 +0000",
      "description": "<p>“Tania is not defined solely by this moment,” Councilor Brian Worrell wrote as his former colleague awaited sentencing on federal charges.</p>\n<p>The post <a href=\"https://www.boston.com/news/politics/2025/09/05/boston-city-councilors-write-support-tania-fernandes-anderson-sentencing/\">As Fernandes Anderson’s sentencing looms, read what Boston city councilors wrote in letters to judge</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "91abd073b835562e1a95bda4c6b702c6",
      "summary": [
        "Boston City Councilor Brian Worrell supports Tania Fernandes Anderson ahead of her sentencing.",
        "Councilors submitted letters to the judge highlighting her contributions to the community.",
        "Fernandes Anderson faces federal charges, impacting her political future and community trust."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "A Somerville church said it was ‘called by God’ to open a homeless shelter. Neighbors took them to court.",
      "link": "https://www.boston.com/news/the-boston-globe/2025/09/05/a-somerville-church-said-it-was-called-by-god-to-open-a-homeless-shelter-neighbors-took-them-to-court/",
      "pubDate": "Fri, 05 Sep 2025 18:01:19 +0000",
      "description": "<p>SOMERVILLE — As a light rain fell over Davis Square on Wednesday, a judge, teams of lawyers, a pastor, a nonprofit director, and a few others quietly toured the basement of the First Church of Somerville and inspected each of the space’s rooms. They saw mattresses still wrapped in plastic piled up next to empty [&#8230;]</p>\n<p>The post <a href=\"https://www.boston.com/news/the-boston-globe/2025/09/05/a-somerville-church-said-it-was-called-by-god-to-open-a-homeless-shelter-neighbors-took-them-to-court/\">A Somerville church said it was ‘called by God’ to open a homeless shelter. Neighbors took them to court.</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "f8c923e2b64286d410a99842451df780",
      "summary": [
        "First Church of Somerville plans to open a homeless shelter amid community opposition.",
        "A judge inspected the church's basement on September 5, 2025, with legal teams present.",
        "Local residents are challenging the shelter's opening, raising concerns about neighborhood safety."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "2 teens arrested in D.C. shooting that killed UMass student, officials say",
      "link": "https://www.boston.com/news/crime/2025/09/05/2-teens-arrested-in-d-c-shooting-that-killed-umass-student-officials-say/",
      "pubDate": "Fri, 05 Sep 2025 17:27:18 +0000",
      "description": "<p>Eric Tarpinian-Jachym, 21, was an intern for Rep. Ron Estes (R-Kansas) and was fatally shot on the night of June 30. A third suspect remains at large.</p>\n<p>The post <a href=\"https://www.boston.com/news/crime/2025/09/05/2-teens-arrested-in-d-c-shooting-that-killed-umass-student-officials-say/\">2 teens arrested in D.C. shooting that killed UMass student, officials say</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "125a95e16b8ba18e18097d6adcb0d840",
      "summary": [
        "Two teens arrested for the June 30 shooting of UMass student Eric Tarpinian-Jachym.",
        "Tarpinian-Jachym, 21, was interning for Rep. Ron Estes at the time of his death.",
        "Boston residents mourn the loss of a promising student and advocate for increased safety."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Two-thirds of BPS school buses were on time on day 1. Here’s how that compares to last year.",
      "link": "https://www.boston.com/news/education/2025/09/05/boston-school-buses-on-time-rate-first-day/",
      "pubDate": "Fri, 05 Sep 2025 16:40:37 +0000",
      "description": "<p>District officials said they “recognize that further progress is needed” when it comes to getting Boston’s students to school on time.</p>\n<p>The post <a href=\"https://www.boston.com/news/education/2025/09/05/boston-school-buses-on-time-rate-first-day/\">Two-thirds of BPS school buses were on time on day 1. Here’s how that compares to last year.</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "528d0012aba9bc382f0c3d3a9839a79a",
      "summary": [
        "Two-thirds of Boston Public Schools buses were on time on the first day of school.",
        "This on-time rate shows improvement compared to last year's performance.",
        "District officials acknowledge the need for further improvements in transportation reliability."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 6,
    "feedSize": 10,
    "timestamp": "2025-09-05T18:45:04.549844+00:00"
  }
}