{
  "lastUpdated": "2026-02-17T20:42:28.144124+00:00",
  "articles": [
    {
      "title": "Assailant in Pawtucket hockey rink shooting killed ex-wife and son, family says",
      "link": "https://www.boston.com/news/local-news/2026/02/17/assailant-in-pawtucket-hockey-rink-shooting-killed-ex-wife-and-son-family-says/",
      "pubDate": "Tue, 17 Feb 2026 19:48:59 +0000",
      "description": "<p>One of the shooter’s children said her grandparents and a family friend were also wounded in Monday’s shooting. </p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/17/assailant-in-pawtucket-hockey-rink-shooting-killed-ex-wife-and-son-family-says/\">Assailant in Pawtucket hockey rink shooting killed ex-wife and son, family says</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "0e22022ff9263ed7f77ed448fe87f200",
      "summary": [
        "Shooter killed ex-wife and son at Pawtucket hockey rink on February 17.",
        "Two additional victims, grandparents and a family friend, were also wounded.",
        "Boston residents are concerned about safety in public spaces following the incident."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Boston’s Vietnamese community celebrates Tết with culture and tradition",
      "link": "https://www.boston.com/news/community/2026/02/17/bostons-vietnamese-community-celebrates-tet-with-culture-and-tradition/",
      "pubDate": "Tue, 17 Feb 2026 19:29:00 +0000",
      "description": "<p>“This is one day a year where people in the Vietnamese community all gather together, and it’s a safe space for everyone.”</p>\n<p>The post <a href=\"https://www.boston.com/news/community/2026/02/17/bostons-vietnamese-community-celebrates-tet-with-culture-and-tradition/\">Boston’s Vietnamese community celebrates Tết with culture and tradition</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "2f0df652a90b44cbd74b26211571ad16",
      "summary": [
        "Boston's Vietnamese community gathered for Tết celebrations on February 17, fostering cultural unity.",
        "The event provided a safe space for community members to connect and celebrate traditions.",
        "Local businesses benefited from increased foot traffic during the Tết festivities."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "How a New Jersey runner is turning the 2026 Boston Marathon into a personal mission",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/17/kevin-brutus-tedys-team/",
      "pubDate": "Tue, 17 Feb 2026 19:05:12 +0000",
      "description": "<p>\"Heart disease and stroke have deeply impacted my family, and as I grow older, I’ve become more aware of my own health and mortality.\"</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/17/kevin-brutus-tedys-team/\">How a New Jersey runner is turning the 2026 Boston Marathon into a personal mission</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "fbb77e67334ac9ff4068f6097da2d79f",
      "summary": [
        "New Jersey runner Kevin Brutus aims to raise awareness for heart disease at the 2026 Boston Marathon.",
        "Brutus's mission is inspired by personal family experiences with heart disease and stroke.",
        "Boston residents may benefit from increased health awareness and community support initiatives."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 3,
    "feedSize": 10,
    "timestamp": "2026-02-17T20:42:28.144146+00:00"
  }
}