{
  "lastUpdated": "2026-02-13T20:43:08.317370+00:00",
  "articles": [
    {
      "title": "Your Cape Cod winter guide: 20 things to do during the cold months",
      "link": "https://www.boston.com/travel/travel/2026/02/13/your-cape-cod-winter-guide/",
      "pubDate": "Fri, 13 Feb 2026 20:20:44 +0000",
      "description": "<p>From museums to restaurants to breweries, there's plenty of things to do during the winter months on the Cape.</p>\n<p>The post <a href=\"https://www.boston.com/travel/travel/2026/02/13/your-cape-cod-winter-guide/\">Your Cape Cod winter guide: 20 things to do during the cold months</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "14eb6b9e004847e1c8a29825cd44bb88",
      "summary": [
        "Explore 20 winter activities on Cape Cod for Boston residents this season.",
        "Visit local breweries and restaurants to support Cape Cod's economy during winter.",
        "Engage in cultural experiences at museums to enrich winter weekends away from Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "She’s running Boston for people like her with Type 1 Diabetes",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/13/kristine-lapczynski-breakthrough-t1d/",
      "pubDate": "Fri, 13 Feb 2026 20:10:14 +0000",
      "description": "<p>\"I’m running for my family, my patients, and my daughter to show her that Type 1 Diabetes may shape our lives, but it will never stop us from chasing big dreams.\"</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/13/kristine-lapczynski-breakthrough-t1d/\">She&#8217;s running Boston for people like her with Type 1 Diabetes</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "bd2950700579d2ac865f309887991ffc",
      "summary": [
        "Kristine Lapczynski is running the Boston Marathon to raise awareness for Type 1 Diabetes.",
        "She aims to inspire her daughter and others living with Type 1 Diabetes.",
        "Lapczynski's efforts highlight the challenges and resilience of Boston families affected by diabetes."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "She picked up running at age 45. Now at 61, she’s on track for her Six Star medal.",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/13/andrea-nwamarah-meb-foundation/",
      "pubDate": "Fri, 13 Feb 2026 20:04:46 +0000",
      "description": "<p>Andrea Nwamarah is running Boston for the MEB Foundation, which supports healthy youth lifestyles and growth.</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/13/andrea-nwamarah-meb-foundation/\">She picked up running at age 45. Now at 61, she&#8217;s on track for her Six Star medal.</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "2d96f6235860acdecb3f34e0fecdaf5d",
      "summary": [
        "Andrea Nwamarah, 61, is running the Boston Marathon for the MEB Foundation.",
        "She started running at age 45 and aims for a Six Star medal.",
        "The MEB Foundation promotes healthy lifestyles for Boston's youth."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Boston Marathon runner inspired by aunt’s blindness raises money for the visually impaired",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/13/paige-stopperich-massachusetts-association-blind-visually-impaired/",
      "pubDate": "Fri, 13 Feb 2026 20:02:09 +0000",
      "description": "<p>\"Watching her face each day with courage, determination, and resilience has been a profound source of inspiration.\"</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/13/paige-stopperich-massachusetts-association-blind-visually-impaired/\">Boston Marathon runner inspired by aunt’s blindness raises money for the visually impaired</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "f2d1f9f6f8975e82b97ef3dbdff30f0e",
      "summary": [
        "Boston Marathon runner Paige Stopperich raises funds for the visually impaired community.",
        "Stopperich's aunt's blindness inspires her to support the Massachusetts Association for the Blind.",
        "Funds raised will directly benefit local visually impaired residents in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Drake Maye says he doesn’t regret marrying young. What readers said.",
      "link": "https://www.boston.com/community/readers-say/2026/02/13/drake-maye-marrying-young-reader-experiences/",
      "pubDate": "Fri, 13 Feb 2026 19:33:41 +0000",
      "description": "<p>The New England Patriots quarterback praised early marriage ahead of Valentine’s Day. Some readers celebrated 50-plus years together — others called marrying young a mistake.</p>\n<p>The post <a href=\"https://www.boston.com/community/readers-say/2026/02/13/drake-maye-marrying-young-reader-experiences/\">Drake Maye says he doesn’t regret marrying young. What readers said.</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "744c72bee2598d5709f374c6a8861899",
      "summary": [
        "New England Patriots quarterback Drake Maye supports early marriage ahead of Valentine's Day.",
        "Readers shared experiences, with some celebrating over 50 years of marriage.",
        "Debate continues among Boston residents about the merits of marrying young."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Driver accused of killing art collector in Back Bay hit-and-run deemed mentally incompetent",
      "link": "https://www.boston.com/news/crime/2026/02/13/driver-accused-of-killing-art-collector-in-back-bay-hit-and-run-deemed-mentally-incompetent/",
      "pubDate": "Fri, 13 Feb 2026 19:29:12 +0000",
      "description": "<p>An attorney for William Haney said the Boston man has schizophrenia and was “delusional” at the time of the Jan. 3 collision.</p>\n<p>The post <a href=\"https://www.boston.com/news/crime/2026/02/13/driver-accused-of-killing-art-collector-in-back-bay-hit-and-run-deemed-mentally-incompetent/\">Driver accused of killing art collector in Back Bay hit-and-run deemed mentally incompetent</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "7b42d1e0d3d8b3e1419a4ff179b41637",
      "summary": [
        "William Haney, accused of a hit-and-run, deemed mentally incompetent for trial.",
        "Haney's attorney claims he has schizophrenia and was delusional during the January 3 incident.",
        "The ruling raises concerns about accountability in hit-and-run cases in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Teachers describe immigration enforcement’s impact on classrooms in challenge of Trump policy",
      "link": "https://www.boston.com/news/education/2026/02/13/teachers-describe-immigration-enforcements-impact-on-classrooms-in-challenge-of-trump-policy/",
      "pubDate": "Fri, 13 Feb 2026 19:27:10 +0000",
      "description": "<p>In Chelsea, Massachusetts, a teachers union president says immigration enforcement has been more disruptive to learning than the COVID pandemic.</p>\n<p>The post <a href=\"https://www.boston.com/news/education/2026/02/13/teachers-describe-immigration-enforcements-impact-on-classrooms-in-challenge-of-trump-policy/\">Teachers describe immigration enforcement&#8217;s impact on classrooms in challenge of Trump policy</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "d31ca3ec4d41e684e2e6582f92a244c3",
      "summary": [
        "Chelsea teachers report immigration enforcement disrupts learning more than COVID-19 did.",
        "Teachers Union President highlights severe classroom disruptions affecting local students.",
        "Increased anxiety among immigrant families negatively impacts student performance in Boston schools."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Actress Rose Byrne honored as Harvard’s Hasty Pudding Woman of the Year with parade and roast",
      "link": "https://www.boston.com/culture/entertainment/2026/02/13/actress-rose-byrne-honored-as-harvards-hasty-pudding-woman-of-the-year-with-parade-and-roast/",
      "pubDate": "Fri, 13 Feb 2026 19:23:57 +0000",
      "description": "<p>“Hot off a Golden Globe win and an Oscar nomination, it’s only right that she receives the most prestigious award of all: a pudding pot.”</p>\n<p>The post <a href=\"https://www.boston.com/culture/entertainment/2026/02/13/actress-rose-byrne-honored-as-harvards-hasty-pudding-woman-of-the-year-with-parade-and-roast/\">Actress Rose Byrne honored as Harvard&#8217;s Hasty Pudding Woman of the Year with parade and roast</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "fec284107a8004ccd092cb3d3c1e48b1",
      "summary": [
        "Actress Rose Byrne received Harvard's Hasty Pudding Woman of the Year award on February 13.",
        "The event featured a parade and roast, celebrating her recent Golden Globe win and Oscar nomination.",
        "This honor highlights Boston's cultural events, boosting local pride and community engagement."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Mass. pols decry the SAVE America Act. Will it really disenfranchise voters?",
      "link": "https://www.boston.com/news/politics/2026/02/13/massachusetts-politicians-decry-save-america-act-voter-id/",
      "pubDate": "Fri, 13 Feb 2026 19:15:47 +0000",
      "description": "<p>“They’re hoping that this bill will pass and will make it so hard to vote that many American citizens will just give up.”</p>\n<p>The post <a href=\"https://www.boston.com/news/politics/2026/02/13/massachusetts-politicians-decry-save-america-act-voter-id/\">Mass. pols decry the SAVE America Act. Will it really disenfranchise voters?</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "0d29c2f7a58f9344908f25d6adeedbbe",
      "summary": [
        "Massachusetts politicians criticize the SAVE America Act for potentially disenfranchising voters.",
        "The bill aims to impose stricter voting requirements, affecting many citizens' ability to vote.",
        "Local leaders warn that this legislation could discourage voter participation in upcoming elections."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Mass. woman killed while sunbathing after car drives into residential pool area in Florida",
      "link": "https://www.boston.com/news/local-news/2026/02/13/mass-woman-killed-florida-jeep-crashes-pool-area/",
      "pubDate": "Fri, 13 Feb 2026 18:22:35 +0000",
      "description": "<p>Florida authorities said a preliminary investigation indicates that the driver may have suffered from a \"medical episode\" at the time of the crash. </p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/13/mass-woman-killed-florida-jeep-crashes-pool-area/\">Mass. woman killed while sunbathing after car drives into residential pool area in Florida</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "c75cd14795981da158e07f0bbf7e3cd3",
      "summary": [
        "Massachusetts woman killed while sunbathing in Florida residential pool area on February 13.",
        "Driver reportedly suffered a medical episode leading to the crash, according to authorities.",
        "Incident raises safety concerns for Boston residents traveling to Florida vacation spots."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Review & setlist: Brandi Carlile has tailored her ‘Human Tour’ to humans, beautifully",
      "link": "https://www.boston.com/culture/concert-reviews/2026/02/13/review-setlist-brandi-carlile-at-td-garden-boston-feb-12-2026/",
      "pubDate": "Fri, 13 Feb 2026 18:17:56 +0000",
      "description": "<p>The Grammy winner played the second show of her first arena tour at TD Garden Thursday night.</p>\n<p>The post <a href=\"https://www.boston.com/culture/concert-reviews/2026/02/13/review-setlist-brandi-carlile-at-td-garden-boston-feb-12-2026/\">Review &amp; setlist: Brandi Carlile has tailored her &#8216;Human Tour&#8217; to humans, beautifully</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "1b35fa6e65680441c3a42809efa83e98",
      "summary": [
        "Brandi Carlile performed at TD Garden on February 12, 2026, for her 'Human Tour'.",
        "The concert marks Carlile's second show on her first arena tour.",
        "Local residents enjoyed a tailored performance, enhancing Boston's cultural scene."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Delta is bringing back direct flights between Boston and Hawaii",
      "link": "https://www.boston.com/travel/flights/2026/02/13/delta-boston-hawaii-route/",
      "pubDate": "Fri, 13 Feb 2026 18:17:36 +0000",
      "description": "<p>The service begins Dec. 19.</p>\n<p>The post <a href=\"https://www.boston.com/travel/flights/2026/02/13/delta-boston-hawaii-route/\">Delta is bringing back direct flights between Boston and Hawaii</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "86b0fc7e1584fa61257e4278eb76b121",
      "summary": [
        "Delta resumes direct flights from Boston to Hawaii starting December 19.",
        "Flights will provide Boston residents with easier access to Hawaii's tourism.",
        "Increased travel options may boost local economy and tourism-related businesses."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "A renovated Lake Winnipesaukee escape, plus new nonstop flights to Canada",
      "link": "https://www.boston.com/travel/scenic-six/2026/02/13/a-renovated-lake-winnipesaukee-escape-plus-new-nonstop-flights-to-canada/",
      "pubDate": "Fri, 13 Feb 2026 17:37:36 +0000",
      "description": "<p>Take a peak inside Mill Falls Resort Collection’s resort-wide makeover — plus a look at new Boston-to-Canada routes launching in May.</p>\n<p>The post <a href=\"https://www.boston.com/travel/scenic-six/2026/02/13/a-renovated-lake-winnipesaukee-escape-plus-new-nonstop-flights-to-canada/\">A renovated Lake Winnipesaukee escape, plus new nonstop flights to Canada</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "973a235514c9b1e66ff36d2dae5f5302",
      "summary": [
        "Mill Falls Resort Collection completed a major renovation to enhance guest experience.",
        "New nonstop flights from Boston to Canada will begin in May 2024.",
        "Boston residents gain easier access to Lake Winnipesaukee and Canadian destinations."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Justice Department sues Harvard for data as it investigates how race factors into admissions",
      "link": "https://www.boston.com/news/education/2026/02/13/justice-department-harvard-data-race-factors-admissions/",
      "pubDate": "Fri, 13 Feb 2026 17:36:47 +0000",
      "description": "<p>In a lawsuit filed Friday in federal court in Massachusetts, the Justice Department said Harvard has “thwarted” efforts to investigate potential discrimination.</p>\n<p>The post <a href=\"https://www.boston.com/news/education/2026/02/13/justice-department-harvard-data-race-factors-admissions/\">Justice Department sues Harvard for data as it investigates how race factors into admissions</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "869e21a2f132c9d8d09c77757cb6a4b5",
      "summary": [
        "Justice Department filed a lawsuit against Harvard on February 13, 2026.",
        "Harvard accused of obstructing investigation into racial discrimination in admissions.",
        "Potential implications for Boston students seeking equitable college admissions."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Brayan Bello reflects on rough playoff start, enters Red Sox camp with new pitch",
      "link": "https://www.boston.com/sports/morning-sports-update/2026/02/13/red-sox-brayan-bello-new-pitch-spring-training/",
      "pubDate": "Fri, 13 Feb 2026 17:10:58 +0000",
      "description": "<p>Bello is now throwing a curveball after logging a 5.40 ERA last September.</p>\n<p>The post <a href=\"https://www.boston.com/sports/morning-sports-update/2026/02/13/red-sox-brayan-bello-new-pitch-spring-training/\">Brayan Bello reflects on rough playoff start, enters Red Sox camp with new pitch</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "0fd2453976e5ed575a8b95517d08130b",
      "summary": [
        "Brayan Bello introduces a new curveball pitch at Red Sox spring training.",
        "Bello recorded a 5.40 ERA during the playoffs last September.",
        "Improved pitching could enhance the Red Sox's performance for Boston fans this season."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "A popular Vermont ski resort is under new ownership",
      "link": "https://www.boston.com/travel/skiing/2026/02/13/a-popular-vermont-ski-resort-is-under-new-ownership/",
      "pubDate": "Fri, 13 Feb 2026 16:41:08 +0000",
      "description": "<p>It was named the most family-friendly ski resort in the East by Ski magazine. </p>\n<p>The post <a href=\"https://www.boston.com/travel/skiing/2026/02/13/a-popular-vermont-ski-resort-is-under-new-ownership/\">A popular Vermont ski resort is under new ownership</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "7c28db2cf227369d44054dd26fa51abc",
      "summary": [
        "Vermont's most family-friendly ski resort is now under new ownership as of February 2026.",
        "Ski magazine recognized the resort, boosting its appeal to Boston families seeking winter activities.",
        "Local Boston residents may benefit from improved services and packages at the resort."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Mass. senators push bill that could allow residents to sue ICE agents",
      "link": "https://www.boston.com/news/local-news/2026/02/13/mass-senators-push-bill-that-could-allow-residents-to-sue-ice-agents/",
      "pubDate": "Fri, 13 Feb 2026 15:50:46 +0000",
      "description": "<p>Lawmakers say that the bill is part of a broader effort to push back on the Trump administration's policies. </p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/13/mass-senators-push-bill-that-could-allow-residents-to-sue-ice-agents/\">Mass. senators push bill that could allow residents to sue ICE agents</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "d2045666406a9c9d1731e015031efb8c",
      "summary": [
        "Massachusetts senators propose a bill allowing residents to sue ICE agents for misconduct.",
        "The bill aims to counteract policies from the Trump administration affecting immigrant rights.",
        "If passed, this legislation could significantly empower Boston residents facing ICE actions."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Boston Legacy FC unveils inaugural home uniform, dubbed the ‘First Light’ kit",
      "link": "https://www.boston.com/sports/sports/2026/02/13/boston-legacy-fc-unveils-inaugural-home-uniform-dubbed-the-first-light-kit/",
      "pubDate": "Fri, 13 Feb 2026 15:43:20 +0000",
      "description": "<p>The jersey features logos of the team's sponsors, and the hem tag on the bottom — two bears holding up a soccer ball — is a nod to the Franklin Park Zoo.</p>\n<p>The post <a href=\"https://www.boston.com/sports/sports/2026/02/13/boston-legacy-fc-unveils-inaugural-home-uniform-dubbed-the-first-light-kit/\">Boston Legacy FC unveils inaugural home uniform, dubbed the ‘First Light’ kit</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "817c655ac5fdca29a1821c48ea445690",
      "summary": [
        "Boston Legacy FC launches its inaugural home uniform, named the 'First Light' kit.",
        "The kit features logos from team sponsors and a design nodding to Franklin Park Zoo.",
        "Local fans can support the team with merchandise reflecting Boston's cultural landmarks."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Patriots’ Stefon Diggs pleads not guilty to assault allegation",
      "link": "https://www.boston.com/sports/new-england-patriots/2026/02/13/patriots-stefon-diggs-pleads-not-guilty-to-assault-allegation/",
      "pubDate": "Fri, 13 Feb 2026 15:18:53 +0000",
      "description": "<p>The arraignment at Dedham District Court was postponed until after Super Bowl LX so Diggs could play in the NFL championship game.</p>\n<p>The post <a href=\"https://www.boston.com/sports/new-england-patriots/2026/02/13/patriots-stefon-diggs-pleads-not-guilty-to-assault-allegation/\">Patriots’ Stefon Diggs pleads not guilty to assault allegation</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "0c065eed73601fb37e8cc4f473d63b1e",
      "summary": [
        "Stefon Diggs pleads not guilty to assault charges in Dedham District Court.",
        "Arraignment postponed until after Super Bowl LX for Diggs to participate.",
        "Local fans await outcome as Diggs plays a pivotal role in the Patriots' championship hopes."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Six arrested in Springfield drug and gun trafficking busts",
      "link": "https://www.boston.com/news/crime/2026/02/13/six-arrested-in-springfield-drug-and-gun-trafficking-busts/",
      "pubDate": "Fri, 13 Feb 2026 15:09:43 +0000",
      "description": "<p>State police seized firearms, fentanyl, cocaine, and $63,000 during two coordinated operations.</p>\n<p>The post <a href=\"https://www.boston.com/news/crime/2026/02/13/six-arrested-in-springfield-drug-and-gun-trafficking-busts/\">Six arrested in Springfield drug and gun trafficking busts</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "429db95af948b8a25fb5762febfce532",
      "summary": [
        "State police arrested six individuals in Springfield for drug and gun trafficking.",
        "Authorities seized $63,000, fentanyl, and cocaine during the coordinated operations.",
        "The bust aims to reduce drug-related violence affecting Boston and surrounding areas."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Dropkick Murphys cut ties with Wasserman agency after CEO’s name appears in Epstein files",
      "link": "https://www.boston.com/news/entertainment/2026/02/13/dropkick-murphys-cut-ties-with-wasserman-agency-after-ceos-name-appears-in-epstein-files/",
      "pubDate": "Fri, 13 Feb 2026 14:39:43 +0000",
      "description": "<p>The Irish-American punk band from Quincy, Mass. joins other entertainers distancing themselves from the agency. </p>\n<p>The post <a href=\"https://www.boston.com/news/entertainment/2026/02/13/dropkick-murphys-cut-ties-with-wasserman-agency-after-ceos-name-appears-in-epstein-files/\">Dropkick Murphys cut ties with Wasserman agency after CEO’s name appears in Epstein files</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "b9973659babd19bd7ea40051292c2154",
      "summary": [
        "Dropkick Murphys severed ties with Wasserman agency amid Epstein scandal on February 13, 2026.",
        "The Quincy-based band joins other entertainers distancing themselves from the agency's CEO.",
        "This decision reflects growing scrutiny of associations with controversial figures in the entertainment industry."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Video: Water pours into South Station from newly renovated ceiling",
      "link": "https://www.boston.com/news/local-news/2026/02/13/video-water-pours-into-south-station/",
      "pubDate": "Fri, 13 Feb 2026 14:21:59 +0000",
      "description": "<p>Cleanup is underway, according to the MBTA. </p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/13/video-water-pours-into-south-station/\">Video: Water pours into South Station from newly renovated ceiling</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "d8f0e53c90c65b41a4b24a043d80303d",
      "summary": [
        "Water leaks from the newly renovated ceiling at South Station, causing disruption.",
        "MBTA has initiated cleanup efforts following the incident on February 13, 2026.",
        "Passengers may experience delays and inconvenience due to ongoing repairs at the station."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Brock Nelson scores twice as US men’s hockey opens Olympic slate by rolling over Latvia",
      "link": "https://www.boston.com/sports/sports/2026/02/13/us-mens-hockey-latvia/",
      "pubDate": "Fri, 13 Feb 2026 14:18:21 +0000",
      "description": "<p>The U.S. stopped Latvia’s surge in its tracks, taking a 5-1 win.</p>\n<p>The post <a href=\"https://www.boston.com/sports/sports/2026/02/13/us-mens-hockey-latvia/\">Brock Nelson scores twice as US men’s hockey opens Olympic slate by rolling over Latvia</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "5df92f31de7b3da3d99c60ac2a737a35",
      "summary": [
        "US men's hockey defeats Latvia 5-1 in Olympic opener on February 13.",
        "Brock Nelson scores two goals, showcasing talent for Boston hockey fans.",
        "Victory boosts US team's morale ahead of upcoming Olympic matches."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Emily Chan and Spencer Howe of The Skating Club of Boston went through injuries, uncertainty to reach the Olympics",
      "link": "https://www.boston.com/sports/local-news/2026/02/13/emily-chan-spencer-howe-skating-club-of-boston/",
      "pubDate": "Fri, 13 Feb 2026 14:14:48 +0000",
      "description": "<p>“Our career has come with a lot of ups and downs ... To be able to achieve this kind of level of skating together just makes it that much more special.”</p>\n<p>The post <a href=\"https://www.boston.com/sports/local-news/2026/02/13/emily-chan-spencer-howe-skating-club-of-boston/\">Emily Chan and Spencer Howe of The Skating Club of Boston went through injuries, uncertainty to reach the Olympics</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "55c6f441a71578edbc784115b858badd",
      "summary": [
        "Emily Chan and Spencer Howe qualify for the Olympics, representing The Skating Club of Boston.",
        "Both athletes overcame significant injuries and uncertainty in their skating careers.",
        "Their success inspires local skaters and highlights Boston's commitment to figure skating."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Ask the Gardener: How snow cover can benefit your garden come spring",
      "link": "https://www.boston.com/real-estate/real-estate/2026/02/13/snow-gardening-new-england-winter-spring/",
      "pubDate": "Fri, 13 Feb 2026 14:13:01 +0000",
      "description": "<p>Boston-area yards have been covered in snow for weeks — a stable condition for dormant plants </p>\n<p>The post <a href=\"https://www.boston.com/real-estate/real-estate/2026/02/13/snow-gardening-new-england-winter-spring/\">Ask the Gardener: How snow cover can benefit your garden come spring</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "4ff9c6e830b4a687aa35f32ccd75b9c7",
      "summary": [
        "Snow cover in Boston protects dormant plants from harsh winter conditions.",
        "Weeks of snow provide insulation, benefiting local gardens for spring growth.",
        "Residents can expect healthier plants due to improved soil moisture retention."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "For Sale by Owner: Should you attempt to sell your own house?",
      "link": "https://www.boston.com/real-estate/real-estate/2026/02/13/for-sale-by-owner-boston-massachusetts-real-estate/",
      "pubDate": "Fri, 13 Feb 2026 12:00:00 +0000",
      "description": "<p>FSBO, as it’s known in the industry, can save sellers thousands in broker fees, but it’s a complicated task  </p>\n<p>The post <a href=\"https://www.boston.com/real-estate/real-estate/2026/02/13/for-sale-by-owner-boston-massachusetts-real-estate/\">For Sale by Owner: Should you attempt to sell your own house?</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "b867e6d69474e095127f8f62116853b2",
      "summary": [
        "FSBO can save Boston sellers thousands in broker fees, but it's complex.",
        "Many Boston homeowners are considering FSBO to avoid high commission costs.",
        "Local real estate experts warn of potential pitfalls in self-selling homes."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Did you follow the local news this week? Take our Greater Boston news quiz.",
      "link": "https://www.boston.com/community/quizzes/2026/02/13/greater-boston-news-quiz-feb-13-2026-super-bowl-boston-restaurants-affleck-dunkin/",
      "pubDate": "Fri, 13 Feb 2026 11:32:36 +0000",
      "description": "<p>Super Bowl fallout, an odor argument, and a Ben Affleck throwback are all part of this week’s news quiz.</p>\n<p>The post <a href=\"https://www.boston.com/community/quizzes/2026/02/13/greater-boston-news-quiz-feb-13-2026-super-bowl-boston-restaurants-affleck-dunkin/\">Did you follow the local news this week? Take our Greater Boston news quiz.</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "c4003be3e454535ea57201ebbee2fe6e",
      "summary": [
        "Review Super Bowl-related impacts on local businesses and restaurants in Boston.",
        "Participate in the Greater Boston news quiz to test your local knowledge.",
        "Engage with community discussions about recent odor issues affecting neighborhoods."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "MBTA Hingham ferry service canceled for Feb. 13 due to ice in the harbor",
      "link": "https://www.boston.com/travel/local-news/2026/02/12/mbta-hingham-ferry-service-canceled-for-feb-13-due-to-ice-in-the-harbor/",
      "pubDate": "Fri, 13 Feb 2026 03:19:08 +0000",
      "description": "<p>The ferry is experiencing more cancellations than usual this winter due to thick ice brought on by the recent snow storm.</p>\n<p>The post <a href=\"https://www.boston.com/travel/local-news/2026/02/12/mbta-hingham-ferry-service-canceled-for-feb-13-due-to-ice-in-the-harbor/\">MBTA Hingham ferry service canceled for Feb. 13 due to ice in the harbor</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "4ff89d8dfc764c283750425839778b0d",
      "summary": [
        "MBTA canceled Hingham ferry service on February 13 due to ice in the harbor.",
        "Cancellations are increasing this winter due to thick ice from recent snow storms.",
        "Boston residents relying on ferry service face transportation disruptions this winter."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Retired Gloucester firefighter dies days after being struck by Lowell police cruiser",
      "link": "https://www.boston.com/news/local-news/2026/02/12/retired-gloucester-firefighter-dies-days-after-being-struck-by-lowell-police-cruiser/",
      "pubDate": "Fri, 13 Feb 2026 03:03:39 +0000",
      "description": "<p>Daniel Kennedy died nearly a week after he was allegedly struck by a Lowell police cruiser at UMass Lowell last Thursday.</p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/12/retired-gloucester-firefighter-dies-days-after-being-struck-by-lowell-police-cruiser/\">Retired Gloucester firefighter dies days after being struck by Lowell police cruiser</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "a02051792230db66b886de139a483ae4",
      "summary": [
        "Retired Gloucester firefighter Daniel Kennedy died after being struck by a police cruiser.",
        "Kennedy was hit at UMass Lowell on February 8, 2023, and died days later.",
        "The incident raises concerns about police vehicle safety in busy campus areas."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "5 players on Red Sox’ roster bubble entering spring training",
      "link": "https://www.boston.com/sports/boston-red-sox/2026/02/12/boston-red-sox-roster-bubble-mlb-spring-training-battle-casas-yoshida-campbell/",
      "pubDate": "Fri, 13 Feb 2026 02:44:08 +0000",
      "description": "<p>The Red Sox still have several logjams in their outfield and within their pitching corps. </p>\n<p>The post <a href=\"https://www.boston.com/sports/boston-red-sox/2026/02/12/boston-red-sox-roster-bubble-mlb-spring-training-battle-casas-yoshida-campbell/\">5 players on Red Sox’ roster bubble entering spring training</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "548366ec68e35fe45c050fe3d3414ca7",
      "summary": [
        "Red Sox face roster decisions as spring training approaches, impacting local fan expectations.",
        "Five players, including Casas and Yoshida, are on the roster bubble ahead of training.",
        "Outfield and pitching logjams could affect team performance and local game attendance."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Plans confirmed for new ICE facility in NH; documents reveal state officials knew for weeks",
      "link": "https://www.boston.com/news/local-news/2026/02/12/plans-confirmed-for-new-ice-facility-in-nh-documents-reveal-state-officials-knew-for-weeks/",
      "pubDate": "Fri, 13 Feb 2026 02:14:57 +0000",
      "description": "<p>State documents released Feb. 3 by the ACLU of New Hampshire show that state officials knew about the new ICE facility as early as Jan. 12.</p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/12/plans-confirmed-for-new-ice-facility-in-nh-documents-reveal-state-officials-knew-for-weeks/\">Plans confirmed for new ICE facility in NH; documents reveal state officials knew for weeks</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "6c1562142e76642a617c9dbfe9f83f7d",
      "summary": [
        "State officials confirmed knowledge of new ICE facility in NH as of January 12.",
        "Documents released by ACLU of New Hampshire on February 3 reveal this information.",
        "Boston residents may face increased immigration enforcement and community tensions due to facility."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Ex-Patriots coach Dante Scarnecchia isn’t panicking over Will Campbell’s play",
      "link": "https://www.boston.com/sports/new-england-patriots/2026/02/12/will-campbell-new-england-patriots-nfl-football-left-tackle-guard-dante-scarnecchia/",
      "pubDate": "Fri, 13 Feb 2026 01:08:59 +0000",
      "description": "<p>“I’m putting him right back where he was.”</p>\n<p>The post <a href=\"https://www.boston.com/sports/new-england-patriots/2026/02/12/will-campbell-new-england-patriots-nfl-football-left-tackle-guard-dante-scarnecchia/\">Ex-Patriots coach Dante Scarnecchia isn’t panicking over Will Campbell’s play</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "d9b5d54c3e2ad67691ee0c1b36a8073b",
      "summary": [
        "Dante Scarnecchia reassures fans about Will Campbell's performance as left tackle.",
        "Scarnecchia emphasizes continuity, stating, 'I’m putting him right back where he was.'",
        "Boston residents can expect stability in the Patriots' offensive line moving forward."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Video: Mike Vrabel shares message to distraught Patriots after Super Bowl loss",
      "link": "https://www.boston.com/sports/new-england-patriots/2026/02/12/mike-vrabel-super-bowl-lx-nfl-football-new-england-patriots-locker-room-video-message/",
      "pubDate": "Thu, 12 Feb 2026 23:40:42 +0000",
      "description": "<p>\"We got a lot more days ahead of us. We got a lot more football left in our program.”</p>\n<p>The post <a href=\"https://www.boston.com/sports/new-england-patriots/2026/02/12/mike-vrabel-super-bowl-lx-nfl-football-new-england-patriots-locker-room-video-message/\">Video: Mike Vrabel shares message to distraught Patriots after Super Bowl loss</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "acaf24647ba1a9f1df879b6ed2b9c2b0",
      "summary": [
        "Mike Vrabel addressed the Patriots after their Super Bowl loss on February 12, 2026.",
        "He emphasized the importance of future games and the ongoing football program.",
        "This message aims to uplift Boston fans and players for the upcoming season."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Patriots reportedly make changes to coaching staff, move Williams to ‘high-ranking’ role",
      "link": "https://www.boston.com/sports/new-england-patriots/2026/02/12/new-england-patriots-coaching-staff-change-mike-vrabel-terrell-williams-zak-kuhr/",
      "pubDate": "Thu, 12 Feb 2026 23:19:47 +0000",
      "description": "<p>With Terrell Williams reportedly taking on a new role, Zak Kuhr is the favorite to take over as defensive coordinator. </p>\n<p>The post <a href=\"https://www.boston.com/sports/new-england-patriots/2026/02/12/new-england-patriots-coaching-staff-change-mike-vrabel-terrell-williams-zak-kuhr/\">Patriots reportedly make changes to coaching staff, move Williams to ‘high-ranking’ role</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "45e70d82337a5d9081011a4e570f6c9c",
      "summary": [
        "Patriots promote Terrell Williams to a high-ranking coaching role.",
        "Zak Kuhr is favored to become the new defensive coordinator.",
        "Changes may affect team performance and fan engagement in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Pittsfield man, 69, killed in hit-and-run crash that dragged him ‘lengthy distance,’ DA says",
      "link": "https://www.boston.com/news/local-news/2026/02/12/pittsfield-man-69-killed-in-hit-and-run-crash-that-dragged-him-lengthy-distance-da-says/",
      "pubDate": "Thu, 12 Feb 2026 22:55:14 +0000",
      "description": "<p>The victim, William Colbert, 69, was dragged a \"lengthy distance\" after he became trapped underneath the car, the DA said.</p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/12/pittsfield-man-69-killed-in-hit-and-run-crash-that-dragged-him-lengthy-distance-da-says/\">Pittsfield man, 69, killed in hit-and-run crash that dragged him &#8216;lengthy distance,&#8217; DA says</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "dd586f632950924c7b7d62349f31c5da",
      "summary": [
        "William Colbert, 69, was killed in a hit-and-run incident in Pittsfield.",
        "The crash dragged him a 'lengthy distance' under the vehicle, according to the DA.",
        "This incident raises concerns about pedestrian safety in the Pittsfield area."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "‘This is only the beginning’: Ann Michael Maye shares encouraging message after Patriots Super Bowl loss",
      "link": "https://www.boston.com/sports/new-england-patriots/2026/02/12/ann-michael-maye-patriots-super-bowl-instagramcomments/",
      "pubDate": "Thu, 12 Feb 2026 22:23:25 +0000",
      "description": "<p>\"Not how we wanted it to end but still thanking God for this incredible season\"</p>\n<p>The post <a href=\"https://www.boston.com/sports/new-england-patriots/2026/02/12/ann-michael-maye-patriots-super-bowl-instagramcomments/\">&#8216;This is only the beginning&#8217;: Ann Michael Maye shares encouraging message after Patriots Super Bowl loss</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "0abdcca73d05aa0b19e22d3469afb7d6",
      "summary": [
        "Ann Michael Maye expresses gratitude despite the Patriots' Super Bowl loss on February 12, 2026.",
        "Maye emphasizes optimism for future seasons, stating, 'This is only the beginning.'",
        "Local fans are encouraged to remain hopeful as the team looks to improve."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "‘Love Story’ revisits JFK Jr. and Carolyn Bessette. It’s stirred some backlash.",
      "link": "https://www.boston.com/culture/entertainment/2026/02/12/love-story-revisits-jfk-kennedy-jr-and-carolyn-bessette-its-stirred-some-backlash/",
      "pubDate": "Thu, 12 Feb 2026 21:46:49 +0000",
      "description": "<p>It details a meet cute at a party and culminates in the deaths of the couple and Bessette's sister Lauren Bessette on July 16, 1999, when a small plane piloted by Kennedy crashed into the Atlantic Ocean.</p>\n<p>The post <a href=\"https://www.boston.com/culture/entertainment/2026/02/12/love-story-revisits-jfk-kennedy-jr-and-carolyn-bessette-its-stirred-some-backlash/\">&#8216;Love Story&#8217; revisits JFK Jr. and Carolyn Bessette. It&#8217;s stirred some backlash.</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "5052cee0a71e436272b0b721d461b41f",
      "summary": [
        "Film 'Love Story' portrays JFK Jr. and Carolyn Bessette's romance and tragic end.",
        "The couple, along with Lauren Bessette, died in a plane crash on July 16, 1999.",
        "Local residents express backlash over the film's portrayal of their lives and deaths."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "EPA ends credits for automatic start-stop vehicle ignition, a feature Zeldin says ‘everyone hates’",
      "link": "https://www.boston.com/cars/national-news/2026/02/12/epa-ends-credits-for-automatic-start-stop-vehicle-ignition-a-feature-zeldin-says-everyone-hates/",
      "pubDate": "Thu, 12 Feb 2026 21:20:10 +0000",
      "description": "<p>In remarks with President Donald Trump on Thursday at the White House, Zeldin called start-stop technology the “Obama switch” and said it makes vehicles “die” at every red light and stop sign.</p>\n<p>The post <a href=\"https://www.boston.com/cars/national-news/2026/02/12/epa-ends-credits-for-automatic-start-stop-vehicle-ignition-a-feature-zeldin-says-everyone-hates/\">EPA ends credits for automatic start-stop vehicle ignition, a feature Zeldin says &#8216;everyone hates&#8217;</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "68459da730f361560a96e7d5fba212d1",
      "summary": [
        "EPA ends credits for automatic start-stop vehicle ignition technology effective immediately.",
        "Congressman Lee Zeldin criticizes the feature, calling it the 'Obama switch' during a White House event.",
        "Boston drivers may experience changes in vehicle performance and fuel efficiency due to this decision."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "This dad is running Boston to give back to Boston Children’s Hospital",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/12/nick-gallagher-boston-childrens-hospital/",
      "pubDate": "Thu, 12 Feb 2026 21:08:53 +0000",
      "description": "<p>\"I’m proud to be running with my son as my patient partner — he’s my inspiration, my motivation, and the reason behind every mile.\"</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/12/nick-gallagher-boston-childrens-hospital/\">This dad is running Boston to give back to Boston Children’s Hospital</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "6ceb1d1d2639890ebe5376b595c75237",
      "summary": [
        "Nick Gallagher is running the Boston Marathon to support Boston Children's Hospital.",
        "He runs with his son as his patient partner, emphasizing personal motivation.",
        "Funds raised will directly benefit pediatric care at Boston Children's Hospital."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Her great-grandfather ran the Boston Marathon in 1920. Now she’s doing the same.",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/12/juliette-barney-youth-advocacy-foundation/",
      "pubDate": "Thu, 12 Feb 2026 21:03:59 +0000",
      "description": "<p>Juliette Barney is running the 2026 Boston Marathon to support the Youth Advocacy Foundation's work protecting and empowering youth.</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/12/juliette-barney-youth-advocacy-foundation/\">Her great-grandfather ran the Boston Marathon in 1920. Now she’s doing the same.</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "66a75d2b0cf55d51b0860f1f311a3613",
      "summary": [
        "Juliette Barney will run the 2026 Boston Marathon, continuing her family's legacy.",
        "Her great-grandfather participated in the marathon in 1920, marking a century of tradition.",
        "Barney aims to raise funds for the Youth Advocacy Foundation to support local youth."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Should Boston rebuild Madison Park at Roxbury’s P-3 site?",
      "link": "https://www.boston.com/community/tell-us/2026/02/12/what-should-boston-do-with-madison-park-roxbury/",
      "pubDate": "Thu, 12 Feb 2026 20:52:38 +0000",
      "description": "<p>Developers had planned to build a mixed-use campus with lab space and affordable housing. Now, the city wants to use the parcel for a new Madison Park vocational high school.</p>\n<p>The post <a href=\"https://www.boston.com/community/tell-us/2026/02/12/what-should-boston-do-with-madison-park-roxbury/\">Should Boston rebuild Madison Park at Roxbury’s P-3 site?</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "a5a014d96fb4f980a28ad0dcff551a74",
      "summary": [
        "Boston plans to replace mixed-use campus with a new Madison Park vocational high school.",
        "Developers initially proposed affordable housing and lab space for the Roxbury P-3 site.",
        "The decision aims to enhance vocational education opportunities for local students."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Tom Brady roasts Logan Paul, calls wrestler’s athletic abilities ‘cute’",
      "link": "https://www.boston.com/sports/new-england-patriots/2026/02/12/tom-brady-logan-paul-flag-football/",
      "pubDate": "Thu, 12 Feb 2026 19:59:53 +0000",
      "description": "<p>Tom Brady wanted Logan Paul to know that there are levels to athletic greatness. Both Paul and Brady are set to compete in the Fanatics Flag Football Classic in Saudi Arabia next month. Paul decided to talk some trash while Brady was on set for his &#8220;IMPAULSIVE&#8221; podcast. Brady gave it right back to him. [&#8230;]</p>\n<p>The post <a href=\"https://www.boston.com/sports/new-england-patriots/2026/02/12/tom-brady-logan-paul-flag-football/\">Tom Brady roasts Logan Paul, calls wrestler&#8217;s athletic abilities &#8216;cute&#8217;</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "bed980f2e2e20da0e7d2d70911c112fa",
      "summary": [
        "Tom Brady and Logan Paul will compete in the Fanatics Flag Football Classic in Saudi Arabia next month.",
        "Brady responded to Paul's trash talk during an episode of the 'IMPAULSIVE' podcast.",
        "Boston residents can expect increased media attention on local sports personalities like Brady."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Trump’s EPA revokes scientific finding that underpinned US fight against climate change",
      "link": "https://www.boston.com/news/environment/2026/02/12/trumps-epa-revokes-scientific-finding-that-underpinned-us-fight-against-climate-change/",
      "pubDate": "Thu, 12 Feb 2026 19:29:50 +0000",
      "description": "<p>The rule finalized by the Environmental Protection Agency rescinds a 2009 government declaration known as the endangerment finding that determined that carbon dioxide and other greenhouse gases endanger public health and welfare.</p>\n<p>The post <a href=\"https://www.boston.com/news/environment/2026/02/12/trumps-epa-revokes-scientific-finding-that-underpinned-us-fight-against-climate-change/\">Trump&#8217;s EPA revokes scientific finding that underpinned US fight against climate change</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "cdd57a5aecd5a862179a0e7f6a3c2b9e",
      "summary": [
        "EPA revokes 2009 endangerment finding on greenhouse gases, impacting climate policy.",
        "This decision affects Boston's air quality and public health initiatives.",
        "Local environmental groups may face challenges in advocating for climate action."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Massachusetts emergency room wait times rank among the longest in the U.S.",
      "link": "https://www.boston.com/news/local-news/2026/02/12/massachusetts-ranks-emergency-room-wait-times/",
      "pubDate": "Thu, 12 Feb 2026 18:29:57 +0000",
      "description": "<p>Patients spend an average of 189 minutes — more than three hours — in the emergency department, and longer stays have become more common. What was your experience like? </p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/12/massachusetts-ranks-emergency-room-wait-times/\">Massachusetts emergency room wait times rank among the longest in the U.S.</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "48dfe5c28a6ed376baeed78713a87686",
      "summary": [
        "Patients in Massachusetts wait an average of 189 minutes in emergency rooms.",
        "Longer emergency room stays have become increasingly common across the state.",
        "Boston residents may face delays in receiving urgent medical care due to these wait times."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Report: Retired 5x Pro Bowl left-tackle offers to help train Will Campbell",
      "link": "https://www.boston.com/sports/new-england-patriots/2026/02/12/terron-armstead-will-campbell/",
      "pubDate": "Thu, 12 Feb 2026 18:25:47 +0000",
      "description": "<p>Terron Armstead said Campbell's technique could use some work and volunteered to help him. </p>\n<p>The post <a href=\"https://www.boston.com/sports/new-england-patriots/2026/02/12/terron-armstead-will-campbell/\">Report: Retired 5x Pro Bowl left-tackle offers to help train Will Campbell</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "e858986362c971927d60b9292084d1d7",
      "summary": [
        "Terron Armstead, a retired Pro Bowl left-tackle, offers training to Will Campbell.",
        "Armstead identifies areas for improvement in Campbell's technique as he prepares for the NFL.",
        "This mentorship could enhance Campbell's performance for the New England Patriots in upcoming seasons."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "More than 400 readers voted: $240K in-office Boston job or $120K remote?",
      "link": "https://www.boston.com/community/readers-say/2026/02/12/remote-in-person-job-readers-respond/",
      "pubDate": "Thu, 12 Feb 2026 18:11:54 +0000",
      "description": "<p>Is doubling your salary worth giving up remote flexibility — especially in a city like Boston? </p>\n<p>The post <a href=\"https://www.boston.com/community/readers-say/2026/02/12/remote-in-person-job-readers-respond/\">More than 400 readers voted: $240K in-office Boston job or $120K remote?</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "34fbdd15767201794e55d0269052699b",
      "summary": [
        "Over 400 Boston readers voted on job salary preferences between in-office and remote work.",
        "Respondents faced a choice between a $240K in-office job and a $120K remote position.",
        "The debate highlights local concerns about salary versus work-life balance in Boston's job market."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "City councilor calls for restrictions on e-bikes and mopeds, including ban for food delivery drivers",
      "link": "https://www.boston.com/news/local-news/2026/02/12/city-councilor-calls-for-restrictions-on-e-bikes-and-mopeds-including-ban-for-food-delivery-drivers/",
      "pubDate": "Thu, 12 Feb 2026 18:10:36 +0000",
      "description": "<p>Councilor Ed Flynn argued that e-bikes and other two-wheeled vehicles, often used by delivery drivers, pose a significant public health threat. </p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/12/city-councilor-calls-for-restrictions-on-e-bikes-and-mopeds-including-ban-for-food-delivery-drivers/\">City councilor calls for restrictions on e-bikes and mopeds, including ban for food delivery drivers</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "09433dad8dbe0db2d96ee2af7434caa6",
      "summary": [
        "Councilor Ed Flynn proposes e-bike and moped restrictions in Boston.",
        "Proposed ban specifically targets food delivery drivers using these vehicles.",
        "Concerns raised about public health threats from increased two-wheeled traffic."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Wakefield’s Jessie Diggins fights injury to take bronze in race dominated by Sweden at Milan Cortina Games",
      "link": "https://www.boston.com/sports/sports/2026/02/12/jessie-diggins-bronze-medal-olympics/",
      "pubDate": "Thu, 12 Feb 2026 16:02:26 +0000",
      "description": "<p>“I need a new body. Honestly, I think I’m the happiest, most grateful bronze medalist in the whole world.\" </p>\n<p>The post <a href=\"https://www.boston.com/sports/sports/2026/02/12/jessie-diggins-bronze-medal-olympics/\">Wakefield&#8217;s Jessie Diggins fights injury to take bronze in race dominated by Sweden at Milan Cortina Games</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "6aa6ea90679e5bd1ede83d97982be372",
      "summary": [
        "Wakefield's Jessie Diggins won a bronze medal at the Milan Cortina Games.",
        "Diggins expressed gratitude despite battling injuries during the competition.",
        "Her achievement boosts local pride and inspires Boston athletes."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "The Patriots didn’t finish the way their 2001 ancestors did. Let’s hope they don’t produce a similar follow-up season, either.",
      "link": "https://www.boston.com/sports/new-england-patriots/2026/02/12/patriots-super-bowl-hangover/",
      "pubDate": "Thu, 12 Feb 2026 16:56:23 +0000",
      "description": "<p>The 2002 Patriots missed the playoffs, and stalled in part because of some regrettable offseason moves. </p>\n<p>The post <a href=\"https://www.boston.com/sports/new-england-patriots/2026/02/12/patriots-super-bowl-hangover/\">The Patriots didn’t finish the way their 2001 ancestors did. Let’s hope they don’t produce a similar follow-up season, either.</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "99bda62bd02fbd95668f9052965ea33f",
      "summary": [
        "The 2002 Patriots missed the playoffs after a successful 2001 Super Bowl season.",
        "Offseason moves contributed to the team's decline, similar to past patterns.",
        "Boston fans worry about repeating the disappointing follow-up season."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Video shows corrections officers brawling in elevator at Boston jail",
      "link": "https://www.boston.com/news/local-news/2026/02/12/video-shows-corrections-officers-brawling-in-elevator-at-boston-jail/",
      "pubDate": "Thu, 12 Feb 2026 16:15:40 +0000",
      "description": "<p>The fight among the three women erupted Saturday morning at the Suffolk County House of Correction.</p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/12/video-shows-corrections-officers-brawling-in-elevator-at-boston-jail/\">Video shows corrections officers brawling in elevator at Boston jail</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "b311fa92cf3f1ffbf19a3a66dd21e565",
      "summary": [
        "Three corrections officers fought in an elevator at Suffolk County House of Correction on Saturday.",
        "The incident was captured on video and has raised concerns about officer conduct.",
        "Local residents worry about safety and professionalism within the Boston jail system."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "totalArticles": 50
}