{
  "lastUpdated": "2026-02-19T14:52:26.465464+00:00",
  "articles": [
    {
      "title": "A Wendy’s near you may be closing soon",
      "link": "https://www.boston.com/news/business/2026/02/19/a-wendys-near-you-may-be-closing-soon/",
      "pubDate": "Thu, 19 Feb 2026 14:49:25 +0000",
      "description": "<p>The fast-food chain announced it will close hundreds of restaurants next year to streamline operations. </p>\n<p>The post <a href=\"https://www.boston.com/news/business/2026/02/19/a-wendys-near-you-may-be-closing-soon/\">A Wendy’s near you may be closing soon</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "ac981ae1971b2ee6bad73d9bf6a0dc24",
      "summary": [
        "Wendy's plans to close hundreds of locations in 2024 to streamline operations.",
        "Boston may see several Wendy's closures, affecting local employment and dining options.",
        "Residents should prepare for reduced fast-food choices in their neighborhoods."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "6 maps predicting snowfall totals Friday into Saturday",
      "link": "https://www.boston.com/weather/weather/2026/02/19/5-maps-predicting-snowfall-totals-friday-into-saturday/",
      "pubDate": "Thu, 19 Feb 2026 14:21:56 +0000",
      "description": "<p>\"Bands might shift north with new data later today.\"</p>\n<p>The post <a href=\"https://www.boston.com/weather/weather/2026/02/19/5-maps-predicting-snowfall-totals-friday-into-saturday/\">6 maps predicting snowfall totals Friday into Saturday</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "887de32204b6874d8a17b86797004de1",
      "summary": [
        "Snowfall predictions for Boston range from 3 to 8 inches Friday into Saturday.",
        "New data may shift snow bands north, affecting totals for local areas.",
        "Residents should prepare for potential travel disruptions and hazardous conditions."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Mikaela Shiffrin remembers her late father after winning Olympic slalom gold",
      "link": "https://www.boston.com/sports/sports/2026/02/19/mikaela-shiffrin-remembers-her-late-father-after-winning-olympic-slalom-gold/",
      "pubDate": "Thu, 19 Feb 2026 14:11:15 +0000",
      "description": "<p>Shiffrin says she never stops thinking about her father, who died at the age of 65 in an accident at the family home five years ago.</p>\n<p>The post <a href=\"https://www.boston.com/sports/sports/2026/02/19/mikaela-shiffrin-remembers-her-late-father-after-winning-olympic-slalom-gold/\">Mikaela Shiffrin remembers her late father after winning Olympic slalom gold</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "0191e121c8e27c6485c5ce39a1810276",
      "summary": [
        "Mikaela Shiffrin won Olympic slalom gold, dedicating it to her late father.",
        "Her father passed away five years ago at age 65 in an accident.",
        "Shiffrin's victory inspires Boston residents, highlighting resilience and family legacy."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "The biggest story lines entering Thursday’s Olympic women’s hockey gold medal game between the US and Canada",
      "link": "https://www.boston.com/sports/sports-news/2026/02/19/olympic-womens-hockey-gold-medal-game/",
      "pubDate": "Thu, 19 Feb 2026 14:09:37 +0000",
      "description": "<p>It’s the dominant Americans against the shockingly underdog Canadians. Can Marie-Philip Poulin will her team to a win? Or is it time for Caroline Harvey and the Americans to prove that their time is now?</p>\n<p>The post <a href=\"https://www.boston.com/sports/sports-news/2026/02/19/olympic-womens-hockey-gold-medal-game/\">The biggest story lines entering Thursday’s Olympic women’s hockey gold medal game between the US and Canada</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "0bfe9eb395b09b409e37d00d80d6a328",
      "summary": [
        "US women's hockey team faces Canada in gold medal game on February 19.",
        "Marie-Philip Poulin leads Canada against Caroline Harvey's US squad.",
        "Victory could boost local interest in women's hockey programs in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Why are hockey fans talking about Team USA’s Quinn Hughes ‘seeing ghosts’ at the Winter Olympics?",
      "link": "https://www.boston.com/sports/sports-news/2026/02/19/quinn-hughes-winter-olympics/",
      "pubDate": "Thu, 19 Feb 2026 14:06:33 +0000",
      "description": "<p>The Americans’ top blue-liner often stares into distance when on the bench. He says he’s just thinking about the game, readying himself for his next shift.</p>\n<p>The post <a href=\"https://www.boston.com/sports/sports-news/2026/02/19/quinn-hughes-winter-olympics/\">Why are hockey fans talking about Team USA’s Quinn Hughes ‘seeing ghosts’ at the Winter Olympics?</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "0a49b66838a1c29ee97f4941efb9cdae",
      "summary": [
        "Quinn Hughes, Team USA's top defenseman, prepares mentally during games at the Winter Olympics.",
        "Hughes often appears lost in thought on the bench, focusing on his next shift.",
        "His performance could influence Boston's hockey community's view on mental preparation in sports."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Where to find the best food under $20 in Waltham",
      "link": "https://www.boston.com/food/restaurants/2026/02/19/best-cheap-food-waltham/",
      "pubDate": "Thu, 19 Feb 2026 13:27:44 +0000",
      "description": "<p>In this economy, we could all use a budget-friendly guide to area restaurants.</p>\n<p>The post <a href=\"https://www.boston.com/food/restaurants/2026/02/19/best-cheap-food-waltham/\">Where to find the best food under $20 in Waltham</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "e160df15d066792739bcbd43d34b050d",
      "summary": [
        "Explore budget-friendly dining options in Waltham for under $20.",
        "Discover 10 recommended restaurants offering affordable meals in the area.",
        "Support local businesses while enjoying economical dining experiences amid rising costs."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 6,
    "feedSize": 10,
    "timestamp": "2026-02-19T14:52:26.465486+00:00"
  }
}