{
  "lastUpdated": "2026-02-03T02:33:05.598064+00:00",
  "articles": [
    {
      "title": "Vermont has no facility for people incompetent to stand trial. Could that finally change?",
      "link": "https://www.boston.com/news/local-news/2026/02/02/vermont-has-no-facility-for-people-incompetent-to-stand-trial-could-that-finally-change/",
      "pubDate": "Tue, 03 Feb 2026 00:04:06 +0000",
      "description": "<p>Vermont lawmakers are considering a bill to address the gap. The debate centers on balancing defendants’ rights with public safety.</p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/02/vermont-has-no-facility-for-people-incompetent-to-stand-trial-could-that-finally-change/\">Vermont has no facility for people incompetent to stand trial. Could that finally change?</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "127362317993948696a6851fd1dd6824",
      "summary": [
        "Vermont lawmakers are debating a bill to create trial competency facilities.",
        "The proposed legislation aims to balance defendants' rights and public safety.",
        "Boston residents may see changes in legal proceedings involving incompetent defendants."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Former North Shore police officer gets prison time for child porn charge",
      "link": "https://www.boston.com/news/local-news/2026/02/02/former-north-shore-police-officer-gets-prison-time-for-child-porn-charge/",
      "pubDate": "Tue, 03 Feb 2026 00:00:49 +0000",
      "description": "<p>The former patrol officer is sentenced to 4 years of prison and 5 years of supervised release, prosecutors say.</p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/02/former-north-shore-police-officer-gets-prison-time-for-child-porn-charge/\">Former North Shore police officer gets prison time for child porn charge</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "e2360653bda1df70195e31d37559c1d4",
      "summary": [
        "Former North Shore police officer sentenced to 4 years in prison for child pornography.",
        "Officer also faces 5 years of supervised release following prison term.",
        "Case raises concerns about trust in local law enforcement among Boston residents."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "‘The finest kind’: Gloucester mourns 7 lost in Lily Jean sinking as Coast Guard launches probe",
      "link": "https://www.boston.com/news/local-news/2026/02/02/gloucester-mourns-7-lost-lily-jean-fishing-boat-sinking/",
      "pubDate": "Mon, 02 Feb 2026 23:42:52 +0000",
      "description": "<p>“There was nothing atypical or anomalous about their trip. They were doing exactly what we’ve done for 50 years.” </p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/02/gloucester-mourns-7-lost-lily-jean-fishing-boat-sinking/\">‘The finest kind’: Gloucester mourns 7 lost in Lily Jean sinking as Coast Guard launches probe</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "6cc0b851463c140a4c75a819dab847c2",
      "summary": [
        "Seven fishermen from Gloucester lost in the sinking of the Lily Jean.",
        "Coast Guard has launched an investigation into the incident.",
        "Community mourning highlights the risks of local fishing industry."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "NBC bringing Super Bowl pregame show to Alcatraz Island",
      "link": "https://www.boston.com/culture/entertainment/2026/02/02/nbc-bringing-super-bowl-pregame-show-to-alcatraz-island/",
      "pubDate": "Mon, 02 Feb 2026 23:23:38 +0000",
      "description": "<p>NBC announced Monday that the network will broadcast part of its pregame show before Sunday’s game between the Patriots and Seahawks from the island that used to be the site of a maximum security federal prison.</p>\n<p>The post <a href=\"https://www.boston.com/culture/entertainment/2026/02/02/nbc-bringing-super-bowl-pregame-show-to-alcatraz-island/\">NBC bringing Super Bowl pregame show to Alcatraz Island</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "ca5c79814a8c86eefad41949ddbe31eb",
      "summary": [
        "NBC will broadcast part of its Super Bowl pregame show from Alcatraz Island.",
        "The show precedes the Patriots vs. Seahawks game on February 7, 2026.",
        "Boston residents can enjoy unique Super Bowl coverage featuring a historic location."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Why readers think Bill Belichick belonged in the Hall of Fame this year",
      "link": "https://www.boston.com/community/readers-say/2026/02/02/bill-belichick-hall-of-fame-snub/",
      "pubDate": "Mon, 02 Feb 2026 22:18:00 +0000",
      "description": "<p>After Belichick fell short of first-ballot induction into the Class of 2026, Boston.com readers largely called it a snub — though some eluded to Tom Brady and Patriots-era scandals as complicating factors.</p>\n<p>The post <a href=\"https://www.boston.com/community/readers-say/2026/02/02/bill-belichick-hall-of-fame-snub/\">Why readers think Bill Belichick belonged in the Hall of Fame this year</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "e946fea90a593b49687cd9ff53a3e245",
      "summary": [
        "Bill Belichick was not inducted into the Hall of Fame Class of 2026.",
        "Boston.com readers largely viewed this as a snub, citing 2026 as significant.",
        "Local discussions highlight the impact of scandals on Belichick's legacy in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Gas explosion in New Hampshire sparks a fire at a mental health facility",
      "link": "https://www.boston.com/news/local-news/2026/02/02/gas-explosion-in-new-hampshire-sparks-a-fire-at-a-mental-health-facility/",
      "pubDate": "Mon, 02 Feb 2026 22:06:40 +0000",
      "description": "<p>Three firefighters were injured when a natural gas leak caused an explosion and fire at a New Hampshire mental health center, but the building’s tenants and clients all evacuated safely. </p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/02/gas-explosion-in-new-hampshire-sparks-a-fire-at-a-mental-health-facility/\">Gas explosion in New Hampshire sparks a fire at a mental health facility</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "a0e6962d8e501d27a88ff13c1697d0d2",
      "summary": [
        "Gas explosion at a New Hampshire mental health facility injured three firefighters.",
        "All tenants and clients evacuated safely during the incident.",
        "Boston residents should be aware of potential gas safety concerns."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Which Patriots Super Bowl will you never forget?",
      "link": "https://www.boston.com/community/tell-us/2026/02/02/favorite-patriots-super-bowl-memories/",
      "pubDate": "Mon, 02 Feb 2026 21:29:25 +0000",
      "description": "<p>From iconic plays to family traditions, share your most unforgettable Patriots Super Bowl moment.</p>\n<p>The post <a href=\"https://www.boston.com/community/tell-us/2026/02/02/favorite-patriots-super-bowl-memories/\">Which Patriots Super Bowl will you never forget?</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "6964ba0bfae0ed7e42e684e4baf84e3e",
      "summary": [
        "Boston residents are sharing unforgettable moments from Patriots Super Bowl history.",
        "Fans recall iconic plays from Super Bowls XXXVI, XLIX, and LI.",
        "Community engagement strengthens local pride and connection to the Patriots."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "This runner is raising awareness about stroke and heart disease",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/02/liz-lang-tedys-team/",
      "pubDate": "Mon, 02 Feb 2026 21:00:21 +0000",
      "description": "<p>\"If I could inspire even one person reading this right now to be proactive about their health ... then every mile and every challenge will have been worth it.\"</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/02/liz-lang-tedys-team/\">This runner is raising awareness about stroke and heart disease</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "b76762c4b20dad19da70fa79ffecd674",
      "summary": [
        "Runner Liz Lang promotes health awareness for stroke and heart disease in Boston.",
        "Lang aims to inspire at least one person to prioritize their health through her efforts.",
        "Her campaign coincides with the Boston Marathon, engaging local residents in health discussions."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Once a patient, now a runner: She’s running for Boston Children’s Hospital",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/02/molly-kokoski-boston-childrens-hospital/",
      "pubDate": "Mon, 02 Feb 2026 20:49:04 +0000",
      "description": "<p>\"I want to give back to the hospital that saved my life.\"</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/02/molly-kokoski-boston-childrens-hospital/\">Once a patient, now a runner: She’s running for Boston Children’s Hospital</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "ce5f64e1986c93df410ca94c387ebd92",
      "summary": [
        "Molly Kokoski, a former patient, is running to support Boston Children's Hospital.",
        "She aims to raise funds during the Boston Marathon on April 15, 2024.",
        "Kokoski's efforts highlight the hospital's vital role in local healthcare."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Carles Gil, Revolution extend contract into 2028 to accommodate new MLS schedule",
      "link": "https://www.boston.com/sports/sports/2026/02/02/carles-gil-revolution-extend-contract/",
      "pubDate": "Mon, 02 Feb 2026 20:45:54 +0000",
      "description": "<p>The New England Revolution captain extends his contract amid MLS’s calendar shift. </p>\n<p>The post <a href=\"https://www.boston.com/sports/sports/2026/02/02/carles-gil-revolution-extend-contract/\">Carles Gil, Revolution extend contract into 2028 to accommodate new MLS schedule</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "19e1bc4d16bbb66ac63c58c823fc2de9",
      "summary": [
        "Carles Gil extends his contract with New England Revolution through 2028.",
        "The contract extension aligns with the new MLS schedule changes.",
        "Boston residents can expect continued leadership from Gil on the field."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 10,
    "feedSize": 10,
    "timestamp": "2026-02-03T02:33:05.598076+00:00"
  }
}