{
  "lastUpdated": "2026-02-22T14:31:04.421300+00:00",
  "articles": [
    {
      "title": "U.S. Secret Service shot and killed armed man who entered the secure perimeter of Mar-a-Lago",
      "link": "https://www.boston.com/news/national-news/2026/02/22/u-s-secret-service-shot-and-killed-armed-man-who-entered-the-secure-perimeter-of-mar-a-lago/",
      "pubDate": "Sun, 22 Feb 2026 14:11:26 +0000",
      "description": "<p>Although Trump often spends weekends at his resort, he was at the White House during this incident.</p>\n<p>The post <a href=\"https://www.boston.com/news/national-news/2026/02/22/u-s-secret-service-shot-and-killed-armed-man-who-entered-the-secure-perimeter-of-mar-a-lago/\">U.S. Secret Service shot and killed armed man who entered the secure perimeter of Mar-a-Lago</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "ff70b1f5879737a5250446d8558bbf95",
      "summary": [
        "U.S. Secret Service shot and killed an armed man at Mar-a-Lago on February 22.",
        "Donald Trump was not present at the resort during the incident.",
        "Increased security measures may affect local events and residents near Mar-a-Lago."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Methuen woman searching for her wedding dress after dry cleaner mix-up",
      "link": "https://www.boston.com/news/local-news/2026/02/22/methuen-woman-searching-for-her-wedding-dress-after-dry-cleaner-mix-up/",
      "pubDate": "Sun, 22 Feb 2026 14:10:08 +0000",
      "description": "<p>A preservation box, a Facebook post, and a 15-year mystery — Kathleen Shea Dunleavy is hoping to be reunited with her wedding gown.</p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/22/methuen-woman-searching-for-her-wedding-dress-after-dry-cleaner-mix-up/\">Methuen woman searching for her wedding dress after dry cleaner mix-up</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "6d6d875c71027463e4019efc731f433a",
      "summary": [
        "Kathleen Shea Dunleavy seeks her wedding dress lost for 15 years due to a dry cleaner mix-up.",
        "She posted on Facebook to find her gown, which holds significant sentimental value.",
        "The incident highlights challenges residents face with local dry cleaning services."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "NFL receiver Rondale Moore found dead in his Indiana hometown",
      "link": "https://www.boston.com/sports/nfl/2026/02/22/nfl-receiver-rondale-moore-found-dead-in-his-indiana-hometown/",
      "pubDate": "Sun, 22 Feb 2026 13:49:08 +0000",
      "description": "<p>Rondale Moore, the NFL receiver who had season-ending training camp knee injuries in each of the last two years after a standout college career at Purdue and a promising start with the Arizona Cardinals, was found dead Saturday, authorities said</p>\n<p>The post <a href=\"https://www.boston.com/sports/nfl/2026/02/22/nfl-receiver-rondale-moore-found-dead-in-his-indiana-hometown/\">NFL receiver Rondale Moore found dead in his Indiana hometown</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "ab85202abece1c3ff4c2eacca941af42",
      "summary": [
        "NFL receiver Rondale Moore was found dead in Indiana on Saturday.",
        "Moore, a Purdue standout, faced season-ending injuries in the last two years.",
        "His death raises concerns about mental health and athlete support in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Former ‘American Idol’ contestant charged with murder, staging crime scene in wife’s slaying in Ohio",
      "link": "https://www.boston.com/news/crime/2026/02/22/former-american-idol-contestant-charged-with-murder-staging-crime-scene-in-wifes-slaying-in-ohio/",
      "pubDate": "Sun, 22 Feb 2026 13:40:13 +0000",
      "description": "<p>Authorities in Ohio have arrested a former contestant on &#8220;American Idol&#8221; and charged him with shooting and killing his wife and staging the crime scene to mislead investigators</p>\n<p>The post <a href=\"https://www.boston.com/news/crime/2026/02/22/former-american-idol-contestant-charged-with-murder-staging-crime-scene-in-wifes-slaying-in-ohio/\">Former &#8216;American Idol&#8217; contestant charged with murder, staging crime scene in wife&#8217;s slaying in Ohio</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "4e008b226cf429627c9a063f7c48c177",
      "summary": [
        "Former 'American Idol' contestant charged with murder of his wife in Ohio.",
        "Authorities allege he staged the crime scene to mislead investigators.",
        "Boston residents may reflect on domestic violence issues highlighted by this case."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Homeland Security suspends TSA PreCheck and Global Entry airport security programs",
      "link": "https://www.boston.com/news/travel/2026/02/22/homeland-security-suspends-tsa-precheck-and-global-entry-airport-security-programs/",
      "pubDate": "Sun, 22 Feb 2026 13:30:51 +0000",
      "description": "<p>The U.S. Department of Homeland Security is suspending the TSA PreCheck and Global Entry airport security programs as a partial government shutdown continues</p>\n<p>The post <a href=\"https://www.boston.com/news/travel/2026/02/22/homeland-security-suspends-tsa-precheck-and-global-entry-airport-security-programs/\">Homeland Security suspends TSA PreCheck and Global Entry airport security programs</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "47295dad2acc055a9f5a2a5014ac1edb",
      "summary": [
        "Homeland Security suspends TSA PreCheck and Global Entry programs amid ongoing government shutdown.",
        "Boston Logan Airport travelers will face longer security lines without expedited screening options.",
        "Suspension affects thousands of local residents relying on these programs for efficient travel."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "At Chevalier Theatre, Mavis Staples lives up to her legacy of joy and protest",
      "link": "https://www.boston.com/culture/concert-reviews/2026/02/22/at-chevalier-theatre-mavis-staples-lives-up-to-her-legacy-of-joy-and-protest/",
      "pubDate": "Sun, 22 Feb 2026 13:27:10 +0000",
      "description": "<p>Her voice still has that instantly recognizable deep-and-low quality you can feel in your chest.</p>\n<p>The post <a href=\"https://www.boston.com/culture/concert-reviews/2026/02/22/at-chevalier-theatre-mavis-staples-lives-up-to-her-legacy-of-joy-and-protest/\">At Chevalier Theatre, Mavis Staples lives up to her legacy of joy and protest</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "89e2454bf3d65aa4c12b4d705a648094",
      "summary": [
        "Mavis Staples performed at Chevalier Theatre, showcasing her powerful voice and legacy.",
        "The concert highlighted themes of joy and protest, resonating with Boston's diverse community.",
        "Residents experienced a cultural event that celebrates civil rights and music history."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Here’s how the Red Sox plan on handling MLB’s new ABS challenging system",
      "link": "https://www.boston.com/sports/boston-red-sox/2026/02/22/mlb-red-sox-abs-challenge-alex-cora-thoughts/",
      "pubDate": "Sun, 22 Feb 2026 12:59:32 +0000",
      "description": "<p>Wilson Contreras was the first Red Sox to test out the system, winning his challenge in spring training Saturday.</p>\n<p>The post <a href=\"https://www.boston.com/sports/boston-red-sox/2026/02/22/mlb-red-sox-abs-challenge-alex-cora-thoughts/\">Here&#8217;s how the Red Sox plan on handling MLB&#8217;s new ABS challenging system</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "891b8df05b7e7479c1baa82f588605c6",
      "summary": [
        "Wilson Contreras successfully tested MLB's new ABS challenging system during spring training on February 22.",
        "Red Sox manager Alex Cora outlines strategies for utilizing the ABS system effectively this season.",
        "Boston fans can expect improved game management and potentially fewer controversial calls in 2023."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 7,
    "feedSize": 10,
    "timestamp": "2026-02-22T14:31:04.421321+00:00"
  }
}