{
  "lastUpdated": "2026-02-13T20:43:08.316372+00:00",
  "articles": [
    {
      "title": "Your Cape Cod winter guide: 20 things to do during the cold months",
      "link": "https://www.boston.com/travel/travel/2026/02/13/your-cape-cod-winter-guide/",
      "pubDate": "Fri, 13 Feb 2026 20:20:44 +0000",
      "description": "<p>From museums to restaurants to breweries, there's plenty of things to do during the winter months on the Cape.</p>\n<p>The post <a href=\"https://www.boston.com/travel/travel/2026/02/13/your-cape-cod-winter-guide/\">Your Cape Cod winter guide: 20 things to do during the cold months</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "14eb6b9e004847e1c8a29825cd44bb88",
      "summary": [
        "Explore 20 winter activities on Cape Cod for Boston residents this season.",
        "Visit local breweries and restaurants to support Cape Cod's economy during winter.",
        "Engage in cultural experiences at museums to enrich winter weekends away from Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "She’s running Boston for people like her with Type 1 Diabetes",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/13/kristine-lapczynski-breakthrough-t1d/",
      "pubDate": "Fri, 13 Feb 2026 20:10:14 +0000",
      "description": "<p>\"I’m running for my family, my patients, and my daughter to show her that Type 1 Diabetes may shape our lives, but it will never stop us from chasing big dreams.\"</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/13/kristine-lapczynski-breakthrough-t1d/\">She&#8217;s running Boston for people like her with Type 1 Diabetes</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "bd2950700579d2ac865f309887991ffc",
      "summary": [
        "Kristine Lapczynski is running the Boston Marathon to raise awareness for Type 1 Diabetes.",
        "She aims to inspire her daughter and others living with Type 1 Diabetes.",
        "Lapczynski's efforts highlight the challenges and resilience of Boston families affected by diabetes."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "She picked up running at age 45. Now at 61, she’s on track for her Six Star medal.",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/13/andrea-nwamarah-meb-foundation/",
      "pubDate": "Fri, 13 Feb 2026 20:04:46 +0000",
      "description": "<p>Andrea Nwamarah is running Boston for the MEB Foundation, which supports healthy youth lifestyles and growth.</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/13/andrea-nwamarah-meb-foundation/\">She picked up running at age 45. Now at 61, she&#8217;s on track for her Six Star medal.</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "2d96f6235860acdecb3f34e0fecdaf5d",
      "summary": [
        "Andrea Nwamarah, 61, is running the Boston Marathon for the MEB Foundation.",
        "She started running at age 45 and aims for a Six Star medal.",
        "The MEB Foundation promotes healthy lifestyles for Boston's youth."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Boston Marathon runner inspired by aunt’s blindness raises money for the visually impaired",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/13/paige-stopperich-massachusetts-association-blind-visually-impaired/",
      "pubDate": "Fri, 13 Feb 2026 20:02:09 +0000",
      "description": "<p>\"Watching her face each day with courage, determination, and resilience has been a profound source of inspiration.\"</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/13/paige-stopperich-massachusetts-association-blind-visually-impaired/\">Boston Marathon runner inspired by aunt’s blindness raises money for the visually impaired</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "f2d1f9f6f8975e82b97ef3dbdff30f0e",
      "summary": [
        "Boston Marathon runner Paige Stopperich raises funds for the visually impaired community.",
        "Stopperich's aunt's blindness inspires her to support the Massachusetts Association for the Blind.",
        "Funds raised will directly benefit local visually impaired residents in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Drake Maye says he doesn’t regret marrying young. What readers said.",
      "link": "https://www.boston.com/community/readers-say/2026/02/13/drake-maye-marrying-young-reader-experiences/",
      "pubDate": "Fri, 13 Feb 2026 19:33:41 +0000",
      "description": "<p>The New England Patriots quarterback praised early marriage ahead of Valentine’s Day. Some readers celebrated 50-plus years together — others called marrying young a mistake.</p>\n<p>The post <a href=\"https://www.boston.com/community/readers-say/2026/02/13/drake-maye-marrying-young-reader-experiences/\">Drake Maye says he doesn’t regret marrying young. What readers said.</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "744c72bee2598d5709f374c6a8861899",
      "summary": [
        "New England Patriots quarterback Drake Maye supports early marriage ahead of Valentine's Day.",
        "Readers shared experiences, with some celebrating over 50 years of marriage.",
        "Debate continues among Boston residents about the merits of marrying young."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Driver accused of killing art collector in Back Bay hit-and-run deemed mentally incompetent",
      "link": "https://www.boston.com/news/crime/2026/02/13/driver-accused-of-killing-art-collector-in-back-bay-hit-and-run-deemed-mentally-incompetent/",
      "pubDate": "Fri, 13 Feb 2026 19:29:12 +0000",
      "description": "<p>An attorney for William Haney said the Boston man has schizophrenia and was “delusional” at the time of the Jan. 3 collision.</p>\n<p>The post <a href=\"https://www.boston.com/news/crime/2026/02/13/driver-accused-of-killing-art-collector-in-back-bay-hit-and-run-deemed-mentally-incompetent/\">Driver accused of killing art collector in Back Bay hit-and-run deemed mentally incompetent</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "7b42d1e0d3d8b3e1419a4ff179b41637",
      "summary": [
        "William Haney, accused of a hit-and-run, deemed mentally incompetent for trial.",
        "Haney's attorney claims he has schizophrenia and was delusional during the January 3 incident.",
        "The ruling raises concerns about accountability in hit-and-run cases in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Teachers describe immigration enforcement’s impact on classrooms in challenge of Trump policy",
      "link": "https://www.boston.com/news/education/2026/02/13/teachers-describe-immigration-enforcements-impact-on-classrooms-in-challenge-of-trump-policy/",
      "pubDate": "Fri, 13 Feb 2026 19:27:10 +0000",
      "description": "<p>In Chelsea, Massachusetts, a teachers union president says immigration enforcement has been more disruptive to learning than the COVID pandemic.</p>\n<p>The post <a href=\"https://www.boston.com/news/education/2026/02/13/teachers-describe-immigration-enforcements-impact-on-classrooms-in-challenge-of-trump-policy/\">Teachers describe immigration enforcement&#8217;s impact on classrooms in challenge of Trump policy</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "d31ca3ec4d41e684e2e6582f92a244c3",
      "summary": [
        "Chelsea teachers report immigration enforcement disrupts learning more than COVID-19 did.",
        "Teachers Union President highlights severe classroom disruptions affecting local students.",
        "Increased anxiety among immigrant families negatively impacts student performance in Boston schools."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Actress Rose Byrne honored as Harvard’s Hasty Pudding Woman of the Year with parade and roast",
      "link": "https://www.boston.com/culture/entertainment/2026/02/13/actress-rose-byrne-honored-as-harvards-hasty-pudding-woman-of-the-year-with-parade-and-roast/",
      "pubDate": "Fri, 13 Feb 2026 19:23:57 +0000",
      "description": "<p>“Hot off a Golden Globe win and an Oscar nomination, it’s only right that she receives the most prestigious award of all: a pudding pot.”</p>\n<p>The post <a href=\"https://www.boston.com/culture/entertainment/2026/02/13/actress-rose-byrne-honored-as-harvards-hasty-pudding-woman-of-the-year-with-parade-and-roast/\">Actress Rose Byrne honored as Harvard&#8217;s Hasty Pudding Woman of the Year with parade and roast</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "fec284107a8004ccd092cb3d3c1e48b1",
      "summary": [
        "Actress Rose Byrne received Harvard's Hasty Pudding Woman of the Year award on February 13.",
        "The event featured a parade and roast, celebrating her recent Golden Globe win and Oscar nomination.",
        "This honor highlights Boston's cultural events, boosting local pride and community engagement."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Mass. pols decry the SAVE America Act. Will it really disenfranchise voters?",
      "link": "https://www.boston.com/news/politics/2026/02/13/massachusetts-politicians-decry-save-america-act-voter-id/",
      "pubDate": "Fri, 13 Feb 2026 19:15:47 +0000",
      "description": "<p>“They’re hoping that this bill will pass and will make it so hard to vote that many American citizens will just give up.”</p>\n<p>The post <a href=\"https://www.boston.com/news/politics/2026/02/13/massachusetts-politicians-decry-save-america-act-voter-id/\">Mass. pols decry the SAVE America Act. Will it really disenfranchise voters?</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "0d29c2f7a58f9344908f25d6adeedbbe",
      "summary": [
        "Massachusetts politicians criticize the SAVE America Act for potentially disenfranchising voters.",
        "The bill aims to impose stricter voting requirements, affecting many citizens' ability to vote.",
        "Local leaders warn that this legislation could discourage voter participation in upcoming elections."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 9,
    "feedSize": 10,
    "timestamp": "2026-02-13T20:43:08.316394+00:00"
  }
}