{
  "lastUpdated": "2026-02-24T14:54:15.928615+00:00",
  "articles": [
    {
      "title": "In unprecedented decision, The Boston Globe will not print a paper for Feb. 24 delivery",
      "link": "https://www.boston.com/news/the-boston-globe/2026/02/24/in-unprecedented-decision-the-boston-globe-will-not-print-a-paper-for-feb-24-delivery/",
      "pubDate": "Tue, 24 Feb 2026 14:22:58 +0000",
      "description": "<p>For more than 153 years, the press workers of The Boston Globe have overcome the elements, technical snafus, and global pandemics to print a daily newspaper. But in an unprecedented decision, executives determined that the conditions during Monday’s blizzard made it impossible to print and deliver a paper Tuesday morning. A massive nor’easter blasted New [&#8230;]</p>\n<p>The post <a href=\"https://www.boston.com/news/the-boston-globe/2026/02/24/in-unprecedented-decision-the-boston-globe-will-not-print-a-paper-for-feb-24-delivery/\">In unprecedented decision, The Boston Globe will not print a paper for Feb. 24 delivery</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "746a1860656eadfc1a2f8b5e94c9b99b",
      "summary": [
        "The Boston Globe will not print for February 24 delivery due to a blizzard.",
        "This marks the first time in 153 years the paper has missed a delivery.",
        "Residents will lack access to the daily news amid severe weather conditions."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Here’s what Boston meteorologists are saying the day after the historic blizzard",
      "link": "https://www.boston.com/weather/local-news/2026/02/24/heres-what-boston-meteorologists-are-saying-the-day-after-the-historic-blizzard/",
      "pubDate": "Tue, 24 Feb 2026 13:43:23 +0000",
      "description": "<p>\"The blizzard yesterday has put Boston over 60\" for the season which hasn't happened since the infamous snow blitz winter of 2015.\"</p>\n<p>The post <a href=\"https://www.boston.com/weather/local-news/2026/02/24/heres-what-boston-meteorologists-are-saying-the-day-after-the-historic-blizzard/\">Here&#8217;s what Boston meteorologists are saying the day after the historic blizzard</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "7e8d4ccf99f0cf69e8de9005401ec14a",
      "summary": [
        "Boston received a historic blizzard, accumulating over 60 inches of snow this season.",
        "This snowfall marks the first time since 2015 that Boston surpassed 60 inches.",
        "Residents should prepare for potential disruptions in transportation and daily activities."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 2,
    "feedSize": 10,
    "timestamp": "2026-02-24T14:54:15.928635+00:00"
  }
}