{
  "lastUpdated": "2026-02-20T18:54:50.593418+00:00",
  "articles": [
    {
      "title": "Body of Eastham man who fell through ice located after days of searching",
      "link": "https://www.boston.com/news/local-news/2026/02/20/body-of-eastham-man-who-fell-through-ice-located-after-days-of-searching/",
      "pubDate": "Fri, 20 Feb 2026 18:49:18 +0000",
      "description": "<p>Gerard “Jerry” Boucher and his wife, Kathleen “Kit” Boucher, fell through the ice Feb. 14 while walking their dog.</p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/20/body-of-eastham-man-who-fell-through-ice-located-after-days-of-searching/\">Body of Eastham man who fell through ice located after days of searching</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "7cccb3a63180fba1e7e1dbba455501a2",
      "summary": [
        "Gerard 'Jerry' Boucher's body was recovered after falling through ice on February 14.",
        "Boucher and his wife fell while walking their dog in Eastham, impacting local community safety discussions.",
        "The incident raises awareness about ice safety for Boston residents during winter months."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "MSP trooper dragged by vehicle during East Boston stop",
      "link": "https://www.boston.com/news/crime/2026/02/20/msp-trooper-dragged-by-vehicle-during-east-boston-stop/",
      "pubDate": "Fri, 20 Feb 2026 18:31:45 +0000",
      "description": "<p>A New Hampshire man has been arrested and faces charges after dragging the trooper 10 to 20 feet, authorities say. </p>\n<p>The post <a href=\"https://www.boston.com/news/crime/2026/02/20/msp-trooper-dragged-by-vehicle-during-east-boston-stop/\">MSP trooper dragged by vehicle during East Boston stop</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "f21aaa020deef8ca87cd0305ca354bee",
      "summary": [
        "MSP trooper was dragged 10 to 20 feet during a traffic stop in East Boston.",
        "A New Hampshire man was arrested and faces multiple charges related to the incident.",
        "The incident raises concerns about officer safety during traffic stops in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Here’s why readers support voter ID laws, even as some take issue with SAVE America Act",
      "link": "https://www.boston.com/news/politics/2026/02/20/readers-support-voter-id-save-america-act/",
      "pubDate": "Fri, 20 Feb 2026 18:25:42 +0000",
      "description": "<p>Though some readers were flat-out against voter ID requirements, many favored an ID policy — whether through the SAVE act or other means.</p>\n<p>The post <a href=\"https://www.boston.com/news/politics/2026/02/20/readers-support-voter-id-save-america-act/\">Here’s why readers support voter ID laws, even as some take issue with SAVE America Act</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "46b64bd2b80ba79dd39133b47329b694",
      "summary": [
        "Many Boston readers support voter ID laws for increased election security.",
        "Support for ID policies remains strong despite opposition to the SAVE America Act.",
        "Potential implementation of voter ID could affect local voting processes in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Mack Hollins fell just short of a stat worth $400K in incentives. The Patriots paid it anyway.",
      "link": "https://www.boston.com/sports/new-england-patriots/2026/02/20/mack-hollins-incentive-contract-patriots-mike-vrabel-comments/",
      "pubDate": "Fri, 20 Feb 2026 17:33:02 +0000",
      "description": "<p>Hollins fell four catches short of the 50 he needed to reach the incentive after missing the final two regular-season games with an injury.</p>\n<p>The post <a href=\"https://www.boston.com/sports/new-england-patriots/2026/02/20/mack-hollins-incentive-contract-patriots-mike-vrabel-comments/\">Mack Hollins fell just short of a stat worth $400K in incentives. The Patriots paid it anyway.</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "b3fffa03c9989121a518f6c7b1b57428",
      "summary": [
        "Patriots awarded Mack Hollins $400K incentive despite him missing final two games.",
        "Hollins fell four catches short of the 50 needed due to injury.",
        "This decision reflects the team's commitment to supporting players in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Why I’m running the Boston Marathon for charity after 9/11 — and what it means to me",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/20/matt-marino-webb-norden-foundation/",
      "pubDate": "Fri, 20 Feb 2026 17:28:29 +0000",
      "description": "<p>Matt Marino is fundraising for the Webb Norden Foundation — founded by survivors of the Boston Marathon bombings — to help others recover from traumatic events.</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/20/matt-marino-webb-norden-foundation/\">Why I’m running the Boston Marathon for charity after 9/11 — and what it means to me</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "380f3b640f8f38b5c79440ba271bce7f",
      "summary": [
        "Matt Marino is running the Boston Marathon to support the Webb Norden Foundation.",
        "The foundation aids survivors of the Boston Marathon bombings in trauma recovery.",
        "Marino's efforts highlight community resilience and support for local trauma survivors."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Treated at Mass. Eye and Ear as a teen, she’s now running the Boston Marathon to give back",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/20/mary-ellen-burt-mass-eye-and-ear/",
      "pubDate": "Fri, 20 Feb 2026 17:19:54 +0000",
      "description": "<p>\"Every mile I train and every dollar I raise represents my gratitude for the care I once received.\"</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/20/mary-ellen-burt-mass-eye-and-ear/\">Treated at Mass. Eye and Ear as a teen, she’s now running the Boston Marathon to give back</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "41f8252e621c28068f5b7a36b04a6030",
      "summary": [
        "Mary Ellen Burt, a former patient, runs the Boston Marathon to support Mass. Eye and Ear.",
        "She aims to raise funds and gratitude, reflecting on her treatment as a teen.",
        "Her efforts highlight the importance of local healthcare support for Boston residents."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "New Mass. and Cass recommendations could mark major shift in strategy",
      "link": "https://www.boston.com/news/local-news/2026/02/20/new-mass-and-cass-recommendations-could-mark-major-shift-in-strategy/",
      "pubDate": "Fri, 20 Feb 2026 16:57:36 +0000",
      "description": "<p>Leaders want to expand units of police and case managers, as well as create a \"specialty court\" to taker a tougher approach on public drug use.</p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/20/new-mass-and-cass-recommendations-could-mark-major-shift-in-strategy/\">New Mass. and Cass recommendations could mark major shift in strategy</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "b8d322eed8e9c391659160cb1d7065a6",
      "summary": [
        "Leaders propose expanding police and case manager units in Mass. and Cass area.",
        "A new specialty court aims to address public drug use more rigorously.",
        "These changes could significantly alter local responses to drug-related issues in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Massachusetts is 1 of 4 states that lost private-sector jobs over the last five years",
      "link": "https://www.boston.com/news/business/2026/02/20/massachusetts-is-1-of-4-states-that-lost-private-sector-jobs-over-the-last-five-years/",
      "pubDate": "Fri, 20 Feb 2026 16:52:23 +0000",
      "description": "<p>Economists say the losses can ripple through the state’s economy, leading to fewer job opportunities, lower tax revenue, and less consumer spending. </p>\n<p>The post <a href=\"https://www.boston.com/news/business/2026/02/20/massachusetts-is-1-of-4-states-that-lost-private-sector-jobs-over-the-last-five-years/\">Massachusetts is 1 of 4 states that lost private-sector jobs over the last five years</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "27645b2279e5326e8be6ba482ed816a7",
      "summary": [
        "Massachusetts lost private-sector jobs over the last five years, affecting local employment.",
        "Only four states experienced this decline, highlighting a concerning trend for Boston's economy.",
        "Job losses may lead to reduced tax revenue and lower consumer spending in the region."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 8,
    "feedSize": 10,
    "timestamp": "2026-02-20T18:54:50.593439+00:00"
  }
}