{
  "lastUpdated": "2025-11-01T22:18:58.238550+00:00",
  "articles": [
    {
      "title": "9 things to know about Red Sox’ situation entering MLB offseason",
      "link": "https://www.boston.com/sports/boston-red-sox/2025/11/01/red-sox-offseason-payroll-mlb-free-agency-trade-rumors/",
      "pubDate": "Sat, 01 Nov 2025 20:34:00 +0000",
      "description": "<p>The Red Sox enter the offseason with some money to spend before entering the luxury tax and could be in play for some top players. </p>\n<p>The post <a href=\"https://www.boston.com/sports/boston-red-sox/2025/11/01/red-sox-offseason-payroll-mlb-free-agency-trade-rumors/\">9 things to know about Red Sox&#8217; situation entering MLB offseason</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "f57ab510712741aca350de2720dd3bcb",
      "summary": [
        "Red Sox prepare for offseason with potential to spend significantly on new players.",
        "Team is close to luxury tax threshold, affecting future spending decisions.",
        "Local fans may see new talent as team aims to improve performance."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "CBS’s Jason McCourty has seen a lot of the Patriots this season, and even he didn’t see this level of success coming",
      "link": "https://www.boston.com/uncategorized/new-england-patriots/2025/11/01/patriots-falcons-preview-jason-mccourty/",
      "pubDate": "Sat, 01 Nov 2025 20:33:06 +0000",
      "description": "<p>McCourty will call a Patriots game for the third time in the regular season on Sunday after calling two of their preseason games. </p>\n<p>The post <a href=\"https://www.boston.com/uncategorized/new-england-patriots/2025/11/01/patriots-falcons-preview-jason-mccourty/\">CBS’s Jason McCourty has seen a lot of the Patriots this season, and even he didn’t see this level of success coming</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "425366651297dfddf41d0f083056481b",
      "summary": [
        "Jason McCourty will commentate on the Patriots' third regular season game this Sunday.",
        "He previously covered two preseason games, gaining insights into the team's performance.",
        "Local fans can expect an informed perspective on the Patriots' unexpected success this season."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 2,
    "feedSize": 10,
    "timestamp": "2025-11-01T22:18:58.238574+00:00"
  }
}