{
  "lastUpdated": "2025-09-12T18:27:41.482455+00:00",
  "articles": [
    {
      "title": "A family-friendly guide to apple picking in New England",
      "link": "https://www.boston.com/travel/travel/2025/09/12/a-family-friendly-guide-to-apple-picking-in-new-england/",
      "pubDate": "Fri, 12 Sep 2025 17:57:11 +0000",
      "description": "<p>Get information about activities planned especially for kids in New England apple orchards this season.</p>\n<p>The post <a href=\"https://www.boston.com/travel/travel/2025/09/12/a-family-friendly-guide-to-apple-picking-in-new-england/\">A family-friendly guide to apple picking in New England</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "725faab735d505a14919513e1a4a8f33",
      "summary": [
        "Explore family-friendly apple picking activities across New England this fall.",
        "Visit local orchards like Honey Pot Hill and Applecrest Farm this September.",
        "Engage kids with fun events while supporting local agriculture in Boston area."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Judge tosses ordinance limiting tear gas, rubber bullet use by Boston police",
      "link": "https://www.boston.com/news/local-news/2025/09/12/judge-tosses-ordinance-limiting-tear-gas-rubber-bullet-use-boston-police/",
      "pubDate": "Fri, 12 Sep 2025 17:28:18 +0000",
      "description": "<p>Judge Jackie Cowin ruled that the Boston City Council overstepped its authority in trying to create policies regarding the police department’s use of weapons.</p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2025/09/12/judge-tosses-ordinance-limiting-tear-gas-rubber-bullet-use-boston-police/\">Judge tosses ordinance limiting tear gas, rubber bullet use by Boston police</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "8b108d3a9490834f871c166b4a0172fb",
      "summary": [
        "Judge Jackie Cowin ruled against Boston City Council's ordinance on police weapon use.",
        "The ordinance aimed to limit tear gas and rubber bullets during protests.",
        "This ruling allows Boston police to continue using these methods without restrictions."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Did a Brooklyn couple kill a neighbor’s trees for a better view in Maine?",
      "link": "https://www.boston.com/news/local-news/2025/09/12/did-a-brooklyn-couple-kill-a-neighbors-trees-for-a-better-view-in-maine/",
      "pubDate": "Fri, 12 Sep 2025 17:14:33 +0000",
      "description": "<p>Maine’s Board of Pesticides Control says two summer residents poisoned a neighbor’s trees so the couple, both Martha Stewart associates, could have a harbor view. They deny it.</p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2025/09/12/did-a-brooklyn-couple-kill-a-neighbors-trees-for-a-better-view-in-maine/\">Did a Brooklyn couple kill a neighbor’s trees for a better view in Maine?</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "a4653cc1982a99de601245d90b812547",
      "summary": [
        "Maine's Board of Pesticides Control claims a couple poisoned neighbor's trees for a harbor view.",
        "The couple, associates of Martha Stewart, deny the allegations of tree poisoning.",
        "Local residents express concern over potential environmental damage and property disputes."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Pharma giant with large Mass. footprint to slash 9,000 jobs globally",
      "link": "https://www.boston.com/news/business/2025/09/12/pharma-giant-with-large-mass-footprint-to-slash-9000-jobs-globally/",
      "pubDate": "Fri, 12 Sep 2025 17:12:46 +0000",
      "description": "<p>The company has not provided details on how local operations will be affected. </p>\n<p>The post <a href=\"https://www.boston.com/news/business/2025/09/12/pharma-giant-with-large-mass-footprint-to-slash-9000-jobs-globally/\">Pharma giant with large Mass. footprint to slash 9,000 jobs globally</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "4e673945787c0d600ab9b75221d351f4",
      "summary": [
        "Pharma giant to cut 9,000 jobs globally, affecting local workforce in Massachusetts.",
        "Company has a significant presence in Massachusetts, but local impact details remain unclear.",
        "Job losses may affect Boston's economy and local healthcare sector stability."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Police officer, suspect shot in Roxbury during chase",
      "link": "https://www.boston.com/news/crime/2025/09/12/police-officer-suspect-shot-in-roxbury-during-chase/",
      "pubDate": "Fri, 12 Sep 2025 16:41:29 +0000",
      "description": "<p>The suspect allegedly fired at officers during a foot pursuit, striking one of the officers in the arm before police returned fire.</p>\n<p>The post <a href=\"https://www.boston.com/news/crime/2025/09/12/police-officer-suspect-shot-in-roxbury-during-chase/\">Police officer, suspect shot in Roxbury during chase</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "82e6896943f944ac2297e9c6c7a7ca6d",
      "summary": [
        "Police officer shot in arm during foot chase in Roxbury on September 12.",
        "Suspect fired at officers before being shot in return fire.",
        "Incident raises concerns about public safety in Boston neighborhoods."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "The last person to question Charlie Kirk",
      "link": "https://www.boston.com/news/national-news/2025/09/12/the-last-person-to-question-charlie-kirk/",
      "pubDate": "Fri, 12 Sep 2025 16:27:48 +0000",
      "description": "<p>Millions of people saw the brief exchange between the right-wing political activist and a liberal TikToker after footage of the assassination spread like wildfire across social media.</p>\n<p>The post <a href=\"https://www.boston.com/news/national-news/2025/09/12/the-last-person-to-question-charlie-kirk/\">The last person to question Charlie Kirk</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "81282dfb3792bec9c7fe1fbc5e81baa7",
      "summary": [
        "Charlie Kirk engaged in a viral exchange with a liberal TikToker amid assassination footage.",
        "Millions viewed the footage, highlighting the influence of social media on political discourse.",
        "Boston residents may see increased local discussions on political activism and social media's role."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 6,
    "feedSize": 10,
    "timestamp": "2025-09-12T18:27:41.482468+00:00"
  }
}