{
  "lastUpdated": "2026-02-18T14:50:28.983001+00:00",
  "articles": [
    {
      "title": "Patriots reportedly set to name Zak Kuhr as defensive coordinator",
      "link": "https://www.boston.com/sports/new-england-patriots/2026/02/18/patriots-zak-kuhr-defensive-coordinator/",
      "pubDate": "Wed, 18 Feb 2026 14:13:12 +0000",
      "description": "<p>Kuhr handled the role in an unofficial capacity during the 2025 season while Terrell Williams was on leave battling cancer.</p>\n<p>The post <a href=\"https://www.boston.com/sports/new-england-patriots/2026/02/18/patriots-zak-kuhr-defensive-coordinator/\">Patriots reportedly set to name Zak Kuhr as defensive coordinator</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "5e1f0866f4460795328b3a9128a86bce",
      "summary": [
        "Patriots to officially name Zak Kuhr as defensive coordinator for 2026 season.",
        "Kuhr served in this role unofficially during the 2025 season.",
        "His promotion may enhance defensive strategies for Boston's NFL team."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Ask the Remodeler: ABCs of ADUs — The basics of building an accessory dwelling unit in Massachusetts",
      "link": "https://www.boston.com/real-estate/real-estate/2026/02/18/adu-massachusetts-building-accessory-dwelling-units/",
      "pubDate": "Wed, 18 Feb 2026 13:59:32 +0000",
      "description": "<p>Following recent columns about ways to create more living space (additions, basement remodels etc.), I wanted to explore a topic that’s receiving a lot of attention lately: ADUs, or accessory dwelling units. In 2024, Massachusetts unveiled a program to allow for accessory dwelling units to be constructed on residential properties that are zoned for single-family [&#8230;]</p>\n<p>The post <a href=\"https://www.boston.com/real-estate/real-estate/2026/02/18/adu-massachusetts-building-accessory-dwelling-units/\">Ask the Remodeler: ABCs of ADUs — The basics of building an accessory dwelling unit in Massachusetts</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "72f5e900edcaf9b698ae1d16fff49358",
      "summary": [
        "Massachusetts will allow accessory dwelling units (ADUs) on single-family zoned properties starting in 2024.",
        "Homeowners can increase living space and rental income potential with ADUs.",
        "Boston residents may see increased housing options and affordability as ADUs become more common."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 2,
    "feedSize": 10,
    "timestamp": "2026-02-18T14:50:28.983020+00:00"
  }
}