{
  "lastUpdated": "2026-02-09T22:41:11.426291+00:00",
  "articles": [
    {
      "title": "Savannah Guthrie makes new video plea as missing mother’s ransom deadline nears",
      "link": "https://www.boston.com/news/national-news/2026/02/09/savannah-guthrie-makes-new-video-plea-as-missing-mothers-ransom-deadline-nears/",
      "pubDate": "Mon, 09 Feb 2026 22:26:39 +0000",
      "description": "<p>“She was taken and we don’t know where, and we need your help,” Guthrie said in the video posted on Instagram, which urged people nationwide to be on the lookout.</p>\n<p>The post <a href=\"https://www.boston.com/news/national-news/2026/02/09/savannah-guthrie-makes-new-video-plea-as-missing-mothers-ransom-deadline-nears/\">Savannah Guthrie makes new video plea as missing mother&#8217;s ransom deadline nears</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "151ad1704d1cb185d5a918f517dee0f1",
      "summary": [
        "Savannah Guthrie urges nationwide vigilance for a missing mother in her recent video.",
        "The ransom deadline is approaching, increasing urgency for community awareness.",
        "Boston residents are encouraged to assist in locating the missing individual."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "For this St. Lucian runner, the Boston Marathon is ‘nothing short of a dream’",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/09/ava-fevrier-lingzi-foundation/",
      "pubDate": "Mon, 09 Feb 2026 21:55:25 +0000",
      "description": "<p>Ava Fevrier is racing for the Lingzi Foundation and aiming to become the first St. Lucian woman to earn a six-star finish in Boston.</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/09/ava-fevrier-lingzi-foundation/\">For this St. Lucian runner, the Boston Marathon is &#8216;nothing short of a dream&#8217;</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "fced5a53ca03d433ea73448a0aa95995",
      "summary": [
        "Ava Fevrier aims to be the first St. Lucian woman to finish the Boston Marathon.",
        "She is racing for the Lingzi Foundation, promoting community support and awareness.",
        "Her participation highlights Boston's diverse running community and inspires local runners."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Actor Henry Winkler named Emerson College’s 2026 commencement speaker",
      "link": "https://www.boston.com/news/local-news/2026/02/09/henry-winkler-emerson-college-commencement-2026/",
      "pubDate": "Mon, 09 Feb 2026 21:39:06 +0000",
      "description": "<p>Winkler rose to national prominence in the 1970s with his iconic portrayal of Arthur “Fonzie” Fonzarelli on “Happy Days.”</p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/09/henry-winkler-emerson-college-commencement-2026/\">Actor Henry Winkler named Emerson College’s 2026 commencement speaker</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "a3ef30d0fa43e20e208fa1f7d5553c59",
      "summary": [
        "Henry Winkler will speak at Emerson College's 2026 commencement ceremony.",
        "Winkler is best known for his role as Fonzie on 'Happy Days' in the 1970s.",
        "This event highlights Emerson's commitment to attracting notable figures for student inspiration."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Ghislaine Maxwell appeals for clemency from Trump as she declines to answer questions from lawmakers",
      "link": "https://www.boston.com/news/crime/2026/02/09/ghislaine-maxwell-appeals-for-clemency-from-trump-as-she-declines-to-answer-questions-from-lawmakers/",
      "pubDate": "Mon, 09 Feb 2026 21:36:06 +0000",
      "description": "<p>The House Oversight Committee had wanted Maxwell to answer questions during a video call, but she invoked her Fifth Amendment rights to avoid answering questions that would be self-incriminating. </p>\n<p>The post <a href=\"https://www.boston.com/news/crime/2026/02/09/ghislaine-maxwell-appeals-for-clemency-from-trump-as-she-declines-to-answer-questions-from-lawmakers/\">Ghislaine Maxwell appeals for clemency from Trump as she declines to answer questions from lawmakers</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "fa539eebfbf1374a2812fc913996530d",
      "summary": [
        "Ghislaine Maxwell invoked the Fifth Amendment during a House Oversight Committee video call.",
        "Maxwell is appealing for clemency from former President Trump amid ongoing legal issues.",
        "Her refusal to testify may affect ongoing investigations related to Boston residents' safety."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Score 20% off JetBlue flights to 3 destinations from Boston with Squares4Fares",
      "link": "https://www.boston.com/travel/flights/2026/02/09/score-20-off-jetblue-flights-to-3-destinations/",
      "pubDate": "Mon, 09 Feb 2026 21:25:45 +0000",
      "description": "<p>The Super Bowl may be over but travelers can still win on these squares. </p>\n<p>The post <a href=\"https://www.boston.com/travel/flights/2026/02/09/score-20-off-jetblue-flights-to-3-destinations/\">Score 20% off JetBlue flights to 3 destinations from Boston with Squares4Fares</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "606a45ea52ddcea82edd0112d2f1d29b",
      "summary": [
        "JetBlue offers 20% off flights from Boston to three destinations.",
        "Promotion available through Squares4Fares, enhancing travel options for local residents.",
        "Discounts aim to attract more travelers post-Super Bowl, boosting local tourism."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "State Police academy supervisor and 3 instructors charged with manslaughter in death of recruit",
      "link": "https://www.boston.com/news/local-news/2026/02/09/state-police-academy-supervisor-and-3-instructors-charged-with-manslaughter-in-death-of-recruit/",
      "pubDate": "Mon, 09 Feb 2026 20:52:46 +0000",
      "description": "<p>Enrique Delgado-Garcia died after suffering injuries during “unauthorized, unapproved, and unsupervised boxing-related sparring exercises,” an independent investigator found. </p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/09/state-police-academy-supervisor-and-3-instructors-charged-with-manslaughter-in-death-of-recruit/\">State Police academy supervisor and 3 instructors charged with manslaughter in death of recruit</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "facde5a7621d70a117b389d84efa6d27",
      "summary": [
        "State Police academy supervisor and three instructors charged with manslaughter in recruit's death.",
        "Enrique Delgado-Garcia died from injuries during unauthorized boxing exercises on February 9, 2026.",
        "Charges raise concerns about training safety protocols for Boston's law enforcement recruits."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 6,
    "feedSize": 10,
    "timestamp": "2026-02-09T22:41:11.426312+00:00"
  }
}