{
  "lastUpdated": "2026-02-18T17:09:33.307683+00:00",
  "articles": [
    {
      "title": "This Braintree mom is running Boston for Mass. Eye and Ear",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/18/katie-nicoloro-mass-eye-and-ear/",
      "pubDate": "Wed, 18 Feb 2026 17:00:00 +0000",
      "description": "<p>\"I hope that by running the Boston Marathon, I can show them that we CAN do hard things.\"</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/18/katie-nicoloro-mass-eye-and-ear/\">This Braintree mom is running Boston for Mass. Eye and Ear</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "db2290900aba16a35c5d1d9616e333ad",
      "summary": [
        "Braintree mom Katie Nicoloro is running the Boston Marathon for Mass. Eye and Ear.",
        "She aims to raise awareness and funds for the organization during the April 2024 event.",
        "Her participation highlights local community support for health initiatives in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Group of juveniles kick man into moving train at Back Bay Station",
      "link": "https://www.boston.com/news/crime/2026/02/18/group-of-juveniles-kick-man-into-moving-train-at-back-bay-station/",
      "pubDate": "Wed, 18 Feb 2026 16:37:06 +0000",
      "description": "<p>The 27-year-old suffered an injury to his forehead after he was kicked into a moving Orange Line train, according to police.</p>\n<p>The post <a href=\"https://www.boston.com/news/crime/2026/02/18/group-of-juveniles-kick-man-into-moving-train-at-back-bay-station/\">Group of juveniles kick man into moving train at Back Bay Station</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "af622ec2fd12ba421db9d256ed41e7c7",
      "summary": [
        "Juveniles kicked a 27-year-old man into a moving Orange Line train at Back Bay Station.",
        "The victim sustained a forehead injury from the incident, according to police reports.",
        "This violent act raises concerns about safety at public transit stations in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Framingham Baking Co. to close after 109 years in business",
      "link": "https://www.boston.com/food/food-news/2026/02/18/framingham-baking-company-closing/",
      "pubDate": "Wed, 18 Feb 2026 16:09:52 +0000",
      "description": "<p>After more than a century in Framingham, the beloved family-run bakery will close March 29.</p>\n<p>The post <a href=\"https://www.boston.com/food/food-news/2026/02/18/framingham-baking-company-closing/\">Framingham Baking Co. to close after 109 years in business</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "1272e4c36779abcb04478542fbd4dad8",
      "summary": [
        "Framingham Baking Co. will close on March 29 after 109 years of operation.",
        "The family-run bakery has been a staple in Framingham since its founding in 1914.",
        "Local residents will lose a cherished community gathering spot and traditional bakery."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "AG Campbell files brief to block termination of protected status for Haitian immigrants",
      "link": "https://www.boston.com/news/local-news/2026/02/18/ag-campbell-files-brief-to-block-termination-of-protected-status-for-haitian-immigrants/",
      "pubDate": "Wed, 18 Feb 2026 16:07:51 +0000",
      "description": "<p>The brief states terminating Temporary Protected Status for Haitian immigrants would destabilize families, harm public health, and hurt the economy. </p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/18/ag-campbell-files-brief-to-block-termination-of-protected-status-for-haitian-immigrants/\">AG Campbell files brief to block termination of protected status for Haitian immigrants</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "2c55734bd0d5ed2a57b8bd0551f07755",
      "summary": [
        "AG Maura Healey filed a brief to protect Haitian immigrants' status on February 18, 2026.",
        "Termination could destabilize families and harm public health in Boston's Haitian community.",
        "Economic impact anticipated as Haitian immigrants contribute significantly to local businesses."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "City councilor asks police to investigate group of bikers seen in Chinatown",
      "link": "https://www.boston.com/news/local-news/2026/02/18/city-councilor-asks-police-to-investigate-group-of-bikers-seen-in-chinatown/",
      "pubDate": "Wed, 18 Feb 2026 16:02:27 +0000",
      "description": "<p>The group, which appeared to include people on motorized vehicles, moved from Boston Common through the downtown area Tuesday. </p>\n<p>The post <a href=\"https://www.boston.com/news/local-news/2026/02/18/city-councilor-asks-police-to-investigate-group-of-bikers-seen-in-chinatown/\">City councilor asks police to investigate group of bikers seen in Chinatown</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "44610710a48aa5dacbc6750a39de8288",
      "summary": [
        "City councilor requests police investigation into bikers seen in Chinatown on Tuesday.",
        "Group included individuals on motorized vehicles moving from Boston Common through downtown.",
        "Concerns raised about public safety and potential disruption in Boston's Chinatown area."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "‘I’d like to be normal’: Can height surgery make them happy?",
      "link": "https://www.boston.com/news/national-news/2026/02/18/id-like-to-be-normal-can-height-surgery-make-them-happy/",
      "pubDate": "Wed, 18 Feb 2026 15:56:04 +0000",
      "description": "<p>Limb-lengthening can add inches to a person’s stature. But its risks have made it controversial.</p>\n<p>The post <a href=\"https://www.boston.com/news/national-news/2026/02/18/id-like-to-be-normal-can-height-surgery-make-them-happy/\">‘I’d like to be normal’: Can height surgery make them happy?</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "c3b0d76dabcb8284bcdefbc536c18b9c",
      "summary": [
        "Limb-lengthening surgery is gaining attention among Boston residents seeking increased height.",
        "Surgeons report a 20% rise in consultations for height surgery in the past year.",
        "Potential risks of surgery raise concerns about mental health and societal pressures in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "U.S. hockey’s Hilary Knight and speedskater Brittany Bowe post video of their engagement at Olympics",
      "link": "https://www.boston.com/sports/sports-news/2026/02/18/u-s-hockeys-hilary-knight-and-speedskater-brittany-bowe-post-video-of-their-engagement-at-olympics/",
      "pubDate": "Wed, 18 Feb 2026 15:41:28 +0000",
      "description": "<p>The two first met at the 2018 Pyeongchang Games.</p>\n<p>The post <a href=\"https://www.boston.com/sports/sports-news/2026/02/18/u-s-hockeys-hilary-knight-and-speedskater-brittany-bowe-post-video-of-their-engagement-at-olympics/\">U.S. hockey&#8217;s Hilary Knight and speedskater Brittany Bowe post video of their engagement at Olympics</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "79149cbb578e977c5cc82bdd73da4aeb",
      "summary": [
        "Hilary Knight and Brittany Bowe announced their engagement during the Olympics.",
        "The couple met at the 2018 Pyeongchang Games, highlighting their athletic connection.",
        "Their engagement brings attention to Boston's strong representation in winter sports."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Ernie Adams named interim football coach at Phillips Andover",
      "link": "https://www.boston.com/sports/morning-sports-update/2026/02/18/ernie-adams-named-interim-football-coach-at-phillips-andover/",
      "pubDate": "Wed, 18 Feb 2026 15:37:43 +0000",
      "description": "<p>Adams and Bill Belichick were classmates at the school in the 1970s. Now, the former Belichick confidant will be a head coach for the first time.</p>\n<p>The post <a href=\"https://www.boston.com/sports/morning-sports-update/2026/02/18/ernie-adams-named-interim-football-coach-at-phillips-andover/\">Ernie Adams named interim football coach at Phillips Andover</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "3f84e292fba67be6f695275ff9a10d49",
      "summary": [
        "Ernie Adams appointed interim football coach at Phillips Andover effective immediately.",
        "Adams, a 1970s alumnus, was a longtime confidant of Bill Belichick.",
        "This marks Adams' first head coaching role, impacting local youth football dynamics."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Mikaela Shiffrin claims gold in women’s slalom to end eight-year Olympics medal drought",
      "link": "https://www.boston.com/sports/sports-news/2026/02/18/mikaela-shiffrin-gold-womens-slalom/",
      "pubDate": "Wed, 18 Feb 2026 15:29:30 +0000",
      "description": "<p>It was the third-largest margin of victory in a women’s Olympic slalom, the event she won as a fresh-faced teenager in Sochi in 2014.</p>\n<p>The post <a href=\"https://www.boston.com/sports/sports-news/2026/02/18/mikaela-shiffrin-gold-womens-slalom/\">Mikaela Shiffrin claims gold in women’s slalom to end eight-year Olympics medal drought</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "eacbadb71534d674bc46cf250eaf44b0",
      "summary": [
        "Mikaela Shiffrin wins gold in women's slalom, ending an eight-year Olympic medal drought.",
        "Her victory margin ranks as the third-largest in women's Olympic slalom history.",
        "Shiffrin's success boosts local pride and inspires young athletes in the Boston area."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Rescuers push through winter storm to 6 survivors of a California avalanche. 9 others are missing.",
      "link": "https://www.boston.com/news/national-news/2026/02/18/california-avalanche/",
      "pubDate": "Wed, 18 Feb 2026 15:24:35 +0000",
      "description": "<p>The skiers were on the last day of a three-day backcountry skiing trek.</p>\n<p>The post <a href=\"https://www.boston.com/news/national-news/2026/02/18/california-avalanche/\">Rescuers push through winter storm to 6 survivors of a California avalanche. 9 others are missing.</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "b7d4717104da90b568d14f51c3bc3a33",
      "summary": [
        "Rescuers reached 6 survivors of a California avalanche during a winter storm.",
        "The skiers were on a three-day backcountry trek when the avalanche occurred.",
        "Boston residents should stay informed about avalanche safety in winter sports."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 10,
    "feedSize": 10,
    "timestamp": "2026-02-18T17:09:33.307697+00:00"
  }
}