{
  "lastUpdated": "2026-02-18T13:14:04.051692+00:00",
  "articles": [
    {
      "title": "Drake Maye refused to make excuses, but after rewatching the Super Bowl, it’s clear he played hurt and it affected him",
      "link": "https://www.boston.com/sports/new-england-patriots/2026/02/18/drake-maye-super-bowl-injury/",
      "pubDate": "Wed, 18 Feb 2026 12:38:53 +0000",
      "description": "<p>The youngest son of a quarterback did exactly what a quarterback is supposed to do: He took one more for the team. But after rewatching the Super Bowl this week, I’m convinced Maye was hurt — and it affected him greatly.</p>\n<p>The post <a href=\"https://www.boston.com/sports/new-england-patriots/2026/02/18/drake-maye-super-bowl-injury/\">Drake Maye refused to make excuses, but after rewatching the Super Bowl, it’s clear he played hurt and it affected him</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "c12c23e97d2fcdc073f6d76347b58d45",
      "summary": [
        "Drake Maye played injured during the Super Bowl, impacting his performance significantly.",
        "Maye's injury raises concerns for the New England Patriots' quarterback strategy moving forward.",
        "Local fans may question the team's decision-making after witnessing Maye's struggles."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Home of the Week: Four-level loft apartment in Boston’s South End for $1.25m",
      "link": "https://www.boston.com/real-estate/home-of-the-week/2026/02/18/boston-south-end-condo-pp-caproni-brother-building/",
      "pubDate": "Wed, 18 Feb 2026 12:00:00 +0000",
      "description": "<p>It’s located in the former production area for P.P. Caproni and Brother, which made plaster reproductions of famous sculptures.</p>\n<p>The post <a href=\"https://www.boston.com/real-estate/home-of-the-week/2026/02/18/boston-south-end-condo-pp-caproni-brother-building/\">Home of the Week: Four-level loft apartment in Boston’s South End for $1.25m</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "d1d159bf2b854e7000f59c53badff054",
      "summary": [
        "Explore a four-level loft apartment in Boston's South End listed for $1.25 million.",
        "The property is situated in a historic building previously used by P.P. Caproni and Brother.",
        "This listing highlights the ongoing demand for unique residential spaces in Boston's real estate market."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "This music teacher is running the Boston Marathon for Parkinson’s research",
      "link": "https://www.boston.com/community/boston-marathon/2026/02/18/owen-hughes-michael-j-fox-foundation/",
      "pubDate": "Wed, 18 Feb 2026 12:00:00 +0000",
      "description": "<p>\"Running the Boston Marathon would be an incredible honor, but running it for my dad, my family, and this cause would make it unforgettable!\"</p>\n<p>The post <a href=\"https://www.boston.com/community/boston-marathon/2026/02/18/owen-hughes-michael-j-fox-foundation/\">This music teacher is running the Boston Marathon for Parkinson&#8217;s research</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "0ee92fb3f629dea358597294b7d018c2",
      "summary": [
        "Music teacher Owen Hughes is running the Boston Marathon on April 15, 2024.",
        "He aims to raise funds for Parkinson’s research through the Michael J. Fox Foundation.",
        "Hughes is motivated by his father's battle with Parkinson's, impacting local families facing similar challenges."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Quirky curling has turned into a betting magnet at the Milan Cortina Olympics",
      "link": "https://www.boston.com/sports/sports/2026/02/18/quirky-curling-has-turned-into-a-betting-magnet-at-the-milan-cortina-olympics/",
      "pubDate": "Wed, 18 Feb 2026 11:03:39 +0000",
      "description": "<p>“It’s kind of relatable, it’s an easy watch, you can understand it very quickly.” </p>\n<p>The post <a href=\"https://www.boston.com/sports/sports/2026/02/18/quirky-curling-has-turned-into-a-betting-magnet-at-the-milan-cortina-olympics/\">Quirky curling has turned into a betting magnet at the Milan Cortina Olympics</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "c2d533b0973098fa7b3ea2acd1e666ff",
      "summary": [
        "Curling's popularity has surged, attracting Boston residents to engage in Olympic betting.",
        "Milan Cortina Olympics features curling, appealing to casual viewers and bettors alike.",
        "Local sports bars in Boston report increased patronage during curling events."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 4,
    "feedSize": 10,
    "timestamp": "2026-02-18T13:14:04.051714+00:00"
  }
}