{
  "lastUpdated": "2026-02-05T14:47:56.381584+00:00",
  "articles": [
    {
      "title": "Christian Fauria guides his Bryant College sports media students on a Super Bowl field trip to Radio Row",
      "link": "https://www.boston.com/sports/media/2026/02/05/christian-fauria-super-bowl/",
      "pubDate": "Thu, 05 Feb 2026 13:56:37 +0000",
      "description": "<p>The former Patriots and Seahawks player — now teaching sports media at Bryant University — is working with his students to produce three radio shows live from Radio Show.</p>\n<p>The post <a href=\"https://www.boston.com/sports/media/2026/02/05/christian-fauria-super-bowl/\">Christian Fauria guides his Bryant College sports media students on a Super Bowl field trip to Radio Row</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "7b54ccfddad7321286bf2e30bc97da8d",
      "summary": [
        "Christian Fauria leads Bryant University students on a Super Bowl field trip to Radio Row.",
        "Students will produce three live radio shows during the event on February 5.",
        "This experience enhances local students' media skills and industry connections in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "Amid setbacks and tragedy, K’Lavon Chaisson’s road has led him to Super Bowl LX",
      "link": "https://www.boston.com/sports/new-england-patriots/2026/02/05/klavon-chaisson-nfl-new-england-patriots-super-bowl-lx/",
      "pubDate": "Thu, 05 Feb 2026 13:49:09 +0000",
      "description": "<p>“I think K’Lavon — and those who really know where he's come from — this is probably the least amount of adversity he's ever had to come through, personally.\" </p>\n<p>The post <a href=\"https://www.boston.com/sports/new-england-patriots/2026/02/05/klavon-chaisson-nfl-new-england-patriots-super-bowl-lx/\">Amid setbacks and tragedy, K’Lavon Chaisson’s road has led him to Super Bowl LX</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "170220d802d4bcdd8ef3799b11f8c57c",
      "summary": [
        "K’Lavon Chaisson reaches Super Bowl LX, overcoming significant personal adversity.",
        "Chaisson's journey highlights resilience, impacting local youth in Boston.",
        "His story inspires Boston residents, showcasing perseverance in sports."
      ],
      "hookType": "LOCAL_IMPACT"
    },
    {
      "title": "ADUs bring income and options for Mass. homeowners, but resale value isn’t yet clear",
      "link": "https://www.boston.com/real-estate/real-estate/2026/02/05/massachusetts-accessory-dwelling-units-adu-resale-value/",
      "pubDate": "Thu, 05 Feb 2026 13:11:41 +0000",
      "description": "<p>A year since the Affordable Home Act allowed accessory dwelling units to be built across the state, some homeowners are wondering if buyers will want their ADUs when they sell. </p>\n<p>The post <a href=\"https://www.boston.com/real-estate/real-estate/2026/02/05/massachusetts-accessory-dwelling-units-adu-resale-value/\">ADUs bring income and options for Mass. homeowners, but resale value isn’t yet clear</a> appeared first on <a href=\"https://www.boston.com\">Boston.com</a>.</p>",
      "id": "e5494e5e769e7825152edbabd47d393a",
      "summary": [
        "Massachusetts homeowners can now build accessory dwelling units (ADUs) under the Affordable Home Act.",
        "Homeowners are uncertain about the resale value of ADUs one year after the law's implementation.",
        "ADUs provide additional income options for homeowners, impacting housing availability in Boston."
      ],
      "hookType": "LOCAL_IMPACT"
    }
  ],
  "stats": {
    "totalProcessed": 3,
    "feedSize": 10,
    "timestamp": "2026-02-05T14:47:56.381605+00:00"
  }
}